rgregg/esp32-wireless-thermostat/src/thermostat/esp32s3_thermostat_firmware.cpp
#if defined(ARDUINO) && defined(THERMOSTAT_ROLE_THERMOSTAT)

#include "thermostat/esp32s3_thermostat_firmware.h"

#include <atomic>
#include <cctype>
#include <cmath>
#include <cstring>
#include <ctime>
#include <cstdio>

#include <Wire.h>
#include <lvgl.h>
#include <ESPmDNS.h>
#include <Preferences.h>
#include <WiFi.h>
#include "wifi_provisioning_manager.h"
#include "provisioning_gate.h"
#include "thermostat_nvs_keys.h"
#ifdef ARDUINO
#include <nvs.h>
#endif
#ifdef THERMOSTAT_BLE_PROVISIONING
#ifndef IMPROV_WIFI_BLE_ENABLED
#error "THERMOSTAT_BLE_PROVISIONING requires IMPROV_WIFI_BLE_ENABLED (the Improv module is guarded by it)"
#endif
#include "improv_ble_provisioning.h"
#endif
#include <PubSubClient.h>
#include <WebServer.h>
#include <HTTPClient.h>
#include <WiFiClientSecure.h>
#include <esp_mac.h>
#include <esp_system.h>
#include "ota_web_updater.h"
#include "web/web_ui_escape.h"
#include "web/web_ui_shell.h"
#include "web/web_ui_fields.h"

#include "thermostat/thermostat_device_runtime.h"
#include "mqtt_payload.h"
#include "mqtt_topics.h"
#include "wifi_watchdog.h"
#include "weather_icon.h"
#include "thermostat/thermostat_screen_controller.h"
#include "thermostat/ui/thermostat_ui_shared.h"
#include "management_paths.h"
#include "device_registry.h"
#include "mac_address_utils.h"

#include <Adafruit_AHTX0.h>
#include <Adafruit_Si7021.h>

#include "esp_heap_caps.h"
#include "esp_lcd_panel_ops.h"
#include "esp_lcd_panel_rgb.h"
#include "esp_task_wdt.h"
#include "freertos/FreeRTOS.h"
#include "freertos/semphr.h"

namespace thermostat {
namespace {

constexpr int kDisplayWidth = 800;
constexpr int kDisplayHeight = 480;
constexpr uint32_t kUiTickMs = 5;
constexpr uint32_t kRuntimeTickMs = 200;
constexpr uint32_t kSensorPollMs = 60000;
constexpr uint32_t kUiRefreshMs = 500;

constexpr int kBacklightPin = 2;
constexpr int kBacklightFreq = 800;
constexpr int kBacklightResolution = 8;

constexpr uint8_t kGt911Addr = 0x5D;

constexpr int kTouchI2cSda = 19;
constexpr int kTouchI2cScl = 20;
constexpr int kTouchRstPin = 38;
constexpr int kSensorI2cSda = 18;
constexpr int kSensorI2cScl = 17;
constexpr uint32_t kNetworkRetryMs = 5000;
constexpr uint32_t kMqttPublishMs = 10000;
constexpr uint32_t kDisplayInitSettleMs = 150;
constexpr uint32_t kBacklightEnableDelayMs = 400;
constexpr uint32_t kRebootDelayMs = 1000;
constexpr uint32_t kRebootPanelOffDelayMs = 200;
constexpr uint32_t kIsolationRebootMs = 15UL * 60UL * 1000UL;

#ifndef THERMOSTAT_WIFI_SSID
#define THERMOSTAT_WIFI_SSID ""
#endif

#ifndef THERMOSTAT_WIFI_PASSWORD
#define THERMOSTAT_WIFI_PASSWORD ""
#endif

// ESP-NOW-only mode: when 1, the display never joins WiFi and never enters BLE
// provisioning — it brings up the LCD + ESP-NOW only. Useful for a display that
// talks solely to the controller over ESP-NOW (no WiFi infrastructure), and for
// bench validation where WiFi association would fight the pinned ESP-NOW channel.
#ifndef THERMOSTAT_WIFI_DISABLED
#define THERMOSTAT_WIFI_DISABLED 0
#endif

#ifndef THERMOSTAT_MQTT_HOST
#define THERMOSTAT_MQTT_HOST "mqtt.lan"
#endif

#ifndef THERMOSTAT_MQTT_PORT
#define THERMOSTAT_MQTT_PORT 1883
#endif

#ifndef THERMOSTAT_MQTT_USER
#define THERMOSTAT_MQTT_USER ""
#endif

#ifndef THERMOSTAT_MQTT_PASSWORD
#define THERMOSTAT_MQTT_PASSWORD ""
#endif

#ifndef THERMOSTAT_BASE_TOPIC
#define THERMOSTAT_BASE_TOPIC "esp32-wireless-thermostat"
#endif

#ifndef THERMOSTAT_MQTT_DISCOVERY_PREFIX
#define THERMOSTAT_MQTT_DISCOVERY_PREFIX "homeassistant"
#endif

#ifndef THERMOSTAT_DISPLAY_TIMEOUT_S
#define THERMOSTAT_DISPLAY_TIMEOUT_S 300
#endif

#ifndef THERMOSTAT_BACKLIGHT_ACTIVE_PCT
#define THERMOSTAT_BACKLIGHT_ACTIVE_PCT 100
#endif

#ifndef THERMOSTAT_BACKLIGHT_SCREENSAVER_PCT
#define THERMOSTAT_BACKLIGHT_SCREENSAVER_PCT 16
#endif

#ifndef THERMOSTAT_TIME_TZ
#define THERMOSTAT_TIME_TZ "PST8PDT,M3.2.0,M11.1.0"
#endif

#ifndef THERMOSTAT_TIME_NTP_1
#define THERMOSTAT_TIME_NTP_1 "0.pool.ntp.org"
#endif

#ifndef THERMOSTAT_TIME_NTP_2
#define THERMOSTAT_TIME_NTP_2 "1.pool.ntp.org"
#endif

#ifndef THERMOSTAT_TIME_NTP_3
#define THERMOSTAT_TIME_NTP_3 "2.pool.ntp.org"
#endif

#ifndef THERMOSTAT_ESPNOW_PEER_MAC
#define THERMOSTAT_ESPNOW_PEER_MAC "FF:FF:FF:FF:FF:FF"
#endif

#ifndef THERMOSTAT_ESPNOW_LMK
#define THERMOSTAT_ESPNOW_LMK "a1b2c3d4e5f60718293a4b5c6d7e8f90"
#endif

#ifndef THERMOSTAT_ESPNOW_CHANNEL
#define THERMOSTAT_ESPNOW_CHANNEL 6
#endif

#ifndef THERMOSTAT_FIRMWARE_VERSION
#define THERMOSTAT_FIRMWARE_VERSION "dev"
#endif

#ifndef THERMOSTAT_OTA_HOSTNAME
#define THERMOSTAT_OTA_HOSTNAME "esp32-furnace-thermostat"
#endif

#ifndef THERMOSTAT_OTA_PASSWORD
#define THERMOSTAT_OTA_PASSWORD ""
#endif

struct TouchState {
  bool touched = false;
  int16_t x = 0;
  int16_t y = 0;
};

uint16_t g_touch_x_max = kDisplayWidth;
uint16_t g_touch_y_max = kDisplayHeight;

esp_lcd_panel_handle_t g_panel = nullptr;
SemaphoreHandle_t g_flush_ready_sem = nullptr;
SemaphoreHandle_t g_api_mutex = nullptr;
std::atomic<bool> g_mqtt_state_dirty{false};

// Called from ISR when the panel finishes swapping framebuffers at VSYNC
bool IRAM_ATTR on_vsync_ready(esp_lcd_panel_handle_t, const esp_lcd_rgb_panel_event_data_t *,
                               void *) {
  BaseType_t high_task_wakeup = pdFALSE;
  if (g_flush_ready_sem != nullptr) {
    xSemaphoreGiveFromISR(g_flush_ready_sem, &high_task_wakeup);
  }
  return high_task_wakeup == pdTRUE;
}

lv_disp_draw_buf_t g_draw_buf;
lv_color_t *g_buf_1 = nullptr;
lv_color_t *g_buf_2 = nullptr;
lv_disp_drv_t g_disp_drv;
lv_indev_drv_t g_indev_drv;
// True once the RGB panel + LVGL display driver are fully initialized. When the
// LCD bounce-buffer allocation fails (e.g. NimBLE fragmented internal DMA RAM
// during provisioning boot), we run headless: no LVGL display/indev is registered,
// and every UI touchpoint is gated on this flag so the firmware degrades instead
// of dereferencing a null default display. Invariant: g_display_ready ⇒ g_panel
// non-null, and (after setup) g_display_ready ⇒ g_ui_ready.
// Threading: written exactly once on the main task inside init_display_and_lvgl(),
// which runs before the Core-0 web task is created (a full barrier), so no atomic
// is needed. The web task does not read this flag.
bool g_display_ready = false;

TouchState g_touch{};
enum class SensorType : uint8_t { None, AHT, Si7021 };
SensorType g_sensor_type = SensorType::None;
Adafruit_AHTX0 g_aht;
TwoWire g_touch_i2c(0);
TwoWire g_sensor_i2c(1);
Adafruit_Si7021 g_si7021(&g_sensor_i2c);
Preferences g_cfg;
bool g_cfg_ready = false;
WiFiClient g_wifi_client;
PubSubClient g_mqtt(g_wifi_client);
WebServer g_web(80);
bool g_mqtt_discovery_sent = false;
std::atomic<bool> g_web_started{false};
DeviceRegistry g_device_registry;
bool g_mdns_started = false;

ThermostatDeviceRuntime *g_runtime = nullptr;
ThermostatScreenController g_screen;

