rgregg/esp32-wireless-thermostat/src/thermostat/esp32s3_thermostat_firmware.cpp
lv_obj_t *g_tabs = nullptr;
lv_obj_t *g_home_page = nullptr;
lv_obj_t *g_fan_page = nullptr;
lv_obj_t *g_mode_page = nullptr;
lv_obj_t *g_settings_page = nullptr;
lv_obj_t *g_screensaver_page = nullptr;

lv_obj_t *g_status_label = nullptr;
lv_obj_t *g_indoor_label = nullptr;
lv_obj_t *g_humidity_label = nullptr;
lv_obj_t *g_setpoint_label = nullptr;
lv_obj_t *g_outdoor_section = nullptr;
lv_obj_t *g_weather_label = nullptr;
lv_obj_t *g_weather_icon_label = nullptr;
lv_obj_t *g_home_time_label = nullptr;
lv_obj_t *g_home_date_label = nullptr;
lv_obj_t *g_screen_time_label = nullptr;
lv_obj_t *g_screen_weather_label = nullptr;
lv_obj_t *g_screen_indoor_label = nullptr;
lv_obj_t *g_screen_status_label = nullptr;
lv_obj_t *g_settings_diag_label = nullptr;
lv_obj_t *g_settings_display_label = nullptr;
lv_obj_t *g_settings_system_label = nullptr;
lv_obj_t *g_settings_wifi_label = nullptr;
lv_obj_t *g_settings_mqtt_label = nullptr;
lv_obj_t *g_settings_controller_label = nullptr;
lv_obj_t *g_settings_espnow_label = nullptr;
lv_obj_t *g_settings_config_label = nullptr;
lv_obj_t *g_settings_errors_label = nullptr;

lv_obj_t *g_setpoint_column = nullptr;
lv_obj_t *g_filter_label = nullptr;
lv_obj_t *g_fan_status_label = nullptr;
lv_obj_t *g_mode_status_label = nullptr;
lv_obj_t *g_timeout_slider = nullptr;
lv_obj_t *g_brightness_slider = nullptr;
lv_obj_t *g_dim_slider = nullptr;

uint32_t g_last_ui_tick_ms = 0;
uint32_t g_last_runtime_tick_ms = 0;
uint32_t g_last_sensor_poll_ms = 0;
uint32_t g_last_ui_refresh_ms = 0;
uint32_t g_last_mqtt_attempt_ms = 0;
uint32_t g_last_mqtt_publish_ms = 0;
uint32_t g_last_mqtt_command_ms = 0;
WifiProvisioningManager g_wifi;
float g_remote_indoor_temp_c = NAN;
float g_remote_indoor_humidity = NAN;
float g_outdoor_temp_c = 6.0f;
WeatherIcon g_weather_icon = WeatherIcon::Cloudy;
bool g_have_weather_data = false;
uint32_t g_display_timeout_ms = static_cast<uint32_t>(THERMOSTAT_DISPLAY_TIMEOUT_S) * 1000UL;
uint8_t g_cfg_backlight_active_pct = THERMOSTAT_BACKLIGHT_ACTIVE_PCT;
uint8_t g_cfg_backlight_screensaver_pct = THERMOSTAT_BACKLIGHT_SCREENSAVER_PCT;
float g_cfg_temp_comp_c = 0.0f;
bool g_cfg_temp_unit_f = false;
String g_cfg_wifi_ssid = THERMOSTAT_WIFI_SSID;
String g_cfg_wifi_password = THERMOSTAT_WIFI_PASSWORD;
bool g_cfg_wifi_disabled = THERMOSTAT_WIFI_DISABLED;  // NVS "wifi_off": ESP-NOW-only mode
String g_cfg_mqtt_host = THERMOSTAT_MQTT_HOST;
uint16_t g_cfg_mqtt_port = THERMOSTAT_MQTT_PORT;
String g_cfg_mqtt_user = THERMOSTAT_MQTT_USER;
String g_cfg_mqtt_password = THERMOSTAT_MQTT_PASSWORD;
String g_cfg_mqtt_client_id;  // derived: base_topic + "-" + device_mac
String g_cfg_base_topic = THERMOSTAT_BASE_TOPIC;
String g_cfg_discovery_prefix = THERMOSTAT_MQTT_DISCOVERY_PREFIX;
String g_cfg_device_mac;         // Full WiFi MAC "AA:BB:CC:DD:EE:FF"
String g_cfg_device_mac_compact; // Colons stripped "AABBCCDDEEFF", for MQTT/hostnames
bool g_cfg_ha_discovery_enabled = true;
String g_cfg_hostname = THERMOSTAT_OTA_HOSTNAME;
uint8_t g_cfg_espnow_channel = THERMOSTAT_ESPNOW_CHANNEL;
String g_cfg_espnow_peer_mac = THERMOSTAT_ESPNOW_PEER_MAC;
String g_cfg_espnow_lmk = THERMOSTAT_ESPNOW_LMK;
bool g_cfg_mqtt_enabled = true;    // NVS "mqtt_en"
bool g_cfg_espnow_enabled = true;  // NVS "espnow_en"

// Derived from g_cfg_espnow_peer_mac (colons stripped) — single controller MAC for both transports
String controller_mac_compact() {
  return mac_utils::mac_strip_colons(g_cfg_espnow_peer_mac);
}
uint32_t g_cfg_controller_timeout_ms = 30000;
bool g_cfg_mqtt_reconfigure_required = false;
bool g_cfg_reboot_required = false;
uint32_t g_boot_count = 0;
String g_reset_reason = "unknown";
String g_last_mqtt_error = "none";
String g_last_ota_error = "none";
String g_last_espnow_error = "none";
bool g_reboot_requested = false;
uint32_t g_reboot_at_ms = 0;
bool g_backlight_enabled = false;
uint32_t g_backlight_enable_at_ms = 0;
bool g_sensors_initialized = false;  // set true at end of init_sensors()
bool g_ui_ready = false;             // set true at end of create_ui()
uint8_t g_sensor_fail_count = 0;     // consecutive sensor read failures
uint32_t g_isolation_start_ms = 0;   // when both MQTT+ESP-NOW went down (0=not isolated)

// Shadow state for controller telemetry received via MQTT
FurnaceStateCode g_mqtt_ctrl_state = FurnaceStateCode::Error;
bool g_mqtt_ctrl_lockout = false;
bool g_mqtt_ctrl_windows_open = false;
FurnaceMode g_mqtt_ctrl_mode = FurnaceMode::Off;
FanMode g_mqtt_ctrl_fan = FanMode::Automatic;
float g_mqtt_ctrl_setpoint_c = 20.0f;
uint32_t g_mqtt_ctrl_filter_runtime_s = 0;
uint32_t g_mqtt_ctrl_last_update_ms = 0;
uint32_t g_mqtt_ctrl_last_applied_ms = 0;
bool g_mqtt_ctrl_available = false;

uint8_t clamp_percent(long value) {
  if (value < 0) {
    return 0;
  }
  if (value > 100) {
    return 100;
  }
  return static_cast<uint8_t>(value);
}

uint8_t percent_to_duty(uint8_t percent) {
  if (percent >= 100) {
    return 255;
  }
  return static_cast<uint8_t>((static_cast<uint16_t>(percent) * 255U + 50U) / 100U);
}

using mac_utils::mac_full;
using mac_utils::mac_strip_colons;

void load_runtime_config() {
  if (!g_cfg_ready) return;

  // Compute MAC-based suffix for OTA hostname default.
  String mac = mac_full();
  String mac_compact = mac_strip_colons(mac);
  mac_compact.toLowerCase();
  g_cfg_hostname = "display-" + mac_compact;

  // One-time migration: clear stale NVS keys from old config schema.
  g_cfg.remove("shared_id");
  g_cfg.remove("mqtt_cid");
  g_cfg.remove("mqtt_base");
  g_cfg.remove("ctrl_base");

  // Migrate old OTA hostname defaults.
  {
    String stored_ota = g_cfg.getString("ota_host", "");
    if (stored_ota == THERMOSTAT_OTA_HOSTNAME ||
        stored_ota == (String(THERMOSTAT_OTA_HOSTNAME) + "-000000")) {
      g_cfg.remove("ota_host");
    }
  }

  g_cfg_wifi_ssid = g_cfg.getString(thermostat_nvs::kWifiSsid, g_cfg_wifi_ssid);
  g_cfg_wifi_password = g_cfg.getString("wifi_pwd", g_cfg_wifi_password);
  g_cfg_wifi_disabled = g_cfg.getBool(thermostat_nvs::kWifiOff, g_cfg_wifi_disabled);
  g_cfg_mqtt_host = g_cfg.getString("mqtt_host", g_cfg_mqtt_host);
  g_cfg_mqtt_port = static_cast<uint16_t>(g_cfg.getUInt("mqtt_port", g_cfg_mqtt_port));
  g_cfg_mqtt_user = g_cfg.getString("mqtt_user", g_cfg_mqtt_user);
  g_cfg_mqtt_password = g_cfg.getString("mqtt_pwd", g_cfg_mqtt_password);
  g_cfg_base_topic = g_cfg.getString("base_topic", g_cfg_base_topic);
  g_cfg_discovery_prefix = g_cfg.getString("disc_pref", g_cfg_discovery_prefix);
  g_cfg_ha_discovery_enabled = g_cfg.getBool("ha_disc", g_cfg_ha_discovery_enabled);
  g_cfg.remove("device_name");  // legacy key, hostname is now the single name
  // Migrate legacy ctrl_mac NVS key → esp_peer if esp_peer was never set
  if (g_cfg_espnow_peer_mac.length() == 0 || g_cfg_espnow_peer_mac == THERMOSTAT_ESPNOW_PEER_MAC) {
    String legacy = g_cfg.getString("ctrl_mac", "");
    if (legacy.length() > 0) {
      // ctrl_mac was stored without colons; esp_peer uses colon format
      // but mac_strip_colons handles either, so store as-is
      g_cfg_espnow_peer_mac = legacy;
      g_cfg.putString("esp_peer", legacy);
    }
  }
  g_cfg.remove("ctrl_mac"); // clean up legacy key
  g_cfg_hostname = g_cfg.getString("ota_host", g_cfg_hostname);
  g_cfg_espnow_channel = static_cast<uint8_t>(g_cfg.getUChar("esp_ch", g_cfg_espnow_channel));
  g_cfg_espnow_peer_mac = g_cfg.getString("esp_peer", g_cfg_espnow_peer_mac);
  g_cfg_espnow_lmk = g_cfg.getString("esp_lmk", g_cfg_espnow_lmk);
  g_cfg_mqtt_enabled = g_cfg.getBool("mqtt_en", true);
  g_cfg_espnow_enabled = g_cfg.getBool("espnow_en", true);
  g_cfg_controller_timeout_ms = g_cfg.getUInt("ctrl_to", g_cfg_controller_timeout_ms);
  const uint32_t display_timeout_s = g_cfg.getUInt("disp_to_s", THERMOSTAT_DISPLAY_TIMEOUT_S);
  g_display_timeout_ms = display_timeout_s * 1000UL;
  g_cfg_backlight_active_pct =
      clamp_percent(g_cfg.getUChar("bl_act", g_cfg_backlight_active_pct));
  g_cfg_backlight_screensaver_pct =
      clamp_percent(g_cfg.getUChar("bl_dim", g_cfg_backlight_screensaver_pct));
  g_cfg_temp_comp_c = g_cfg.getFloat("temp_comp", 0.0f);
  g_cfg_temp_unit_f = g_cfg.getBool("temp_u_f", false);
}

String device_topic_for(const char *mac, const char *suffix) {
  char buf[192];
  mqtt_topics::device_topic(buf, sizeof(buf), g_cfg_base_topic.c_str(), mac, suffix);
  return String(buf);
}

String self_topic_for(const char *suffix) {
  return device_topic_for(g_cfg_device_mac_compact.c_str(), suffix);
}

