rgregg/esp32-wireless-thermostat/src/thermostat/esp32s3_thermostat_firmware.cpp
String controller_topic_for(const char *suffix) {
  return device_topic_for(controller_mac_compact().c_str(), suffix);
}


bool try_update_runtime_config(const String &key, const char *raw_value) {
  if (!g_cfg_ready || raw_value == nullptr) return false;
  const String value(raw_value);
  bool known = true;
#define NVS_PUT_STR(ns_key, val) \
  do { if (g_cfg.putString((ns_key), (val)) == 0) Serial.printf("[cfg] NVS write failed: %s\n", (ns_key)); } while(0)
#define NVS_PUT_UINT(ns_key, val) \
  do { if (g_cfg.putUInt((ns_key), (val)) == 0) Serial.printf("[cfg] NVS write failed: %s\n", (ns_key)); } while(0)
#define NVS_PUT_UCHAR(ns_key, val) \
  do { if (g_cfg.putUChar((ns_key), (val)) == 0) Serial.printf("[cfg] NVS write failed: %s\n", (ns_key)); } while(0)
#define NVS_PUT_FLOAT(ns_key, val) \
  do { if (g_cfg.putFloat((ns_key), (val)) == 0) Serial.printf("[cfg] NVS write failed: %s\n", (ns_key)); } while(0)
#define NVS_PUT_BOOL(ns_key, val) \
  do { if (g_cfg.putBool((ns_key), (val)) == 0) Serial.printf("[cfg] NVS write failed: %s\n", (ns_key)); } while(0)

  if (key == "wifi_ssid") {
    g_cfg_wifi_ssid = value;
    g_wifi.set_credentials(value.c_str(), g_cfg_wifi_password.c_str());
  } else if (key == "wifi_password") {
    g_cfg_wifi_password = value;
    g_wifi.set_credentials(g_cfg_wifi_ssid.c_str(), value.c_str());
  } else if (key == "mqtt_host") {
    g_cfg_mqtt_host = value;
    NVS_PUT_STR("mqtt_host", value);
    g_cfg_mqtt_reconfigure_required = true;
  } else if (key == "mqtt_port") {
    const long parsed = atol(raw_value);
    if (parsed < 1 || parsed > 65535) return false;
    g_cfg_mqtt_port = static_cast<uint16_t>(parsed);
    NVS_PUT_UINT("mqtt_port", g_cfg_mqtt_port);
    g_cfg_mqtt_reconfigure_required = true;
  } else if (key == "mqtt_user") {
    g_cfg_mqtt_user = value;
    NVS_PUT_STR("mqtt_user", value);
    g_cfg_mqtt_reconfigure_required = true;
  } else if (key == "mqtt_password") {
    g_cfg_mqtt_password = value;
    NVS_PUT_STR("mqtt_pwd", value);
    g_cfg_mqtt_reconfigure_required = true;
  } else if (key == "base_topic") {
    g_cfg_base_topic = value;
    NVS_PUT_STR("base_topic", value);
    // Recompute derived client ID
    char cid_buf[64];
    mqtt_topics::client_id(cid_buf, sizeof(cid_buf), g_cfg_base_topic.c_str(), g_cfg_device_mac_compact.c_str());
    g_cfg_mqtt_client_id = String(cid_buf);
    g_cfg_mqtt_reconfigure_required = true;
    g_mqtt_discovery_sent = false;
  } else if (key == "ha_discovery_enabled") {
    g_cfg_ha_discovery_enabled = (strcmp(raw_value, "1") == 0);
    NVS_PUT_BOOL("ha_disc", g_cfg_ha_discovery_enabled);
    g_mqtt_discovery_sent = false;
  } else if (key == "discovery_prefix") {
    g_cfg_discovery_prefix = value;
    NVS_PUT_STR("disc_pref", value);
    g_mqtt_discovery_sent = false;
  } else if (key == "display_timeout_s") {
    long seconds = atol(raw_value);
    if (seconds < 30) seconds = 30;
    if (seconds > 600) seconds = 600;
    g_display_timeout_ms = static_cast<uint32_t>(seconds) * 1000UL;
    NVS_PUT_UINT("disp_to_s", static_cast<uint32_t>(seconds));
    g_screen.set_display_timeout_ms(g_display_timeout_ms);
  } else if (key == "backlight_active_pct") {
    g_cfg_backlight_active_pct = clamp_percent(atol(raw_value));
    NVS_PUT_UCHAR("bl_act", g_cfg_backlight_active_pct);
  } else if (key == "backlight_screensaver_pct") {
    g_cfg_backlight_screensaver_pct = clamp_percent(atol(raw_value));
    NVS_PUT_UCHAR("bl_dim", g_cfg_backlight_screensaver_pct);
  } else if (key == "temp_comp_c" || key == "temp_comp") {
    float val = static_cast<float>(atof(raw_value));
    if (key == "temp_comp" && g_cfg_temp_unit_f) val = val / 1.8f;
    g_cfg_temp_comp_c = val;
    NVS_PUT_FLOAT("temp_comp", val);
    if (g_runtime != nullptr) {
      g_runtime->set_local_temperature_compensation_c(val);
    }
    g_last_sensor_poll_ms = 0;  // re-read sensor with new compensation
  } else if (key == "temperature_unit") {
    g_cfg_temp_unit_f = (value == "f" || value == "fahrenheit");
    NVS_PUT_BOOL("temp_u_f", g_cfg_temp_unit_f);
    if (g_runtime != nullptr) {
      g_runtime->set_temperature_unit(g_cfg_temp_unit_f ? TemperatureUnit::Fahrenheit
                                                        : TemperatureUnit::Celsius);
    }
    // Forward unit preference to controller on next main-loop publish
    g_mqtt_state_dirty = true;
  } else if (key == "hostname") {
    // Validate: ≤63 chars, [a-zA-Z0-9-], no leading/trailing hyphens
    if (value.length() == 0 || value.length() > 63) return false;
    if (value.charAt(0) == '-' || value.charAt(value.length() - 1) == '-') return false;
    for (unsigned i = 0; i < value.length(); ++i) {
      char c = value.charAt(i);
      if (!isalnum(c) && c != '-') return false;
    }
    g_cfg_hostname = value;
    NVS_PUT_STR("ota_host", value);
    g_mqtt_discovery_sent = false;
    g_cfg_reboot_required = true;  // WiFi/mDNS hostname only applied at boot
  } else if (key == "espnow_channel") {
    const long parsed = atol(raw_value);
    if (parsed < 1 || parsed > 14) return false;
    g_cfg_espnow_channel = static_cast<uint8_t>(parsed);
    NVS_PUT_UCHAR("esp_ch", g_cfg_espnow_channel);
    g_cfg_reboot_required = true;
  } else if (key == "espnow_peer_mac" || key == "paired_controller_mac") {
    g_cfg_espnow_peer_mac = value;
    NVS_PUT_STR("esp_peer", value);
    g_cfg_mqtt_reconfigure_required = true;
    g_cfg_reboot_required = true;
  } else if (key == "espnow_lmk") {
    g_cfg_espnow_lmk = value;
    NVS_PUT_STR("esp_lmk", value);
    g_cfg_reboot_required = true;
  } else if (key == "mqtt_enabled") {
    g_cfg_mqtt_enabled = (strcmp(raw_value, "1") == 0);
    g_cfg.putBool("mqtt_en", g_cfg_mqtt_enabled);
    if (!g_cfg_mqtt_enabled && g_mqtt.connected()) {
      g_mqtt.disconnect();
    }
    g_cfg_mqtt_reconfigure_required = true;
  } else if (key == "espnow_enabled") {
    g_cfg_espnow_enabled = (strcmp(raw_value, "1") == 0);
    g_cfg.putBool("espnow_en", g_cfg_espnow_enabled);
    g_cfg_reboot_required = true;
  } else if (key == "wifi_disabled") {
    g_cfg_wifi_disabled = (strcmp(raw_value, "1") == 0);
    g_cfg.putBool(thermostat_nvs::kWifiOff, g_cfg_wifi_disabled);
    g_cfg_reboot_required = true;
  } else if (key == "controller_timeout_ms") {
    const long parsed = atol(raw_value);
    if (parsed < 1000 || parsed > 600000) return false;
    g_cfg_controller_timeout_ms = static_cast<uint32_t>(parsed);
    NVS_PUT_UINT("ctrl_to", g_cfg_controller_timeout_ms);
    g_cfg_reboot_required = true;
  } else {
    known = false;
  }
  if (!known) return false;
  g_mqtt_state_dirty = true;
  return true;
}

#undef NVS_PUT_STR
#undef NVS_PUT_UINT
#undef NVS_PUT_UCHAR
#undef NVS_PUT_FLOAT
#undef NVS_PUT_BOOL

bool parse_bool_payload(const char *value) {
  return strcmp(value, "1") == 0 || strcmp(value, "true") == 0 || strcmp(value, "on") == 0;
}

