rgregg/esp32-wireless-thermostat/src/thermostat/esp32s3_thermostat_firmware.cpp
void schedule_reboot() {
  g_reboot_requested = true;
  g_reboot_at_ms = millis() + kRebootDelayMs;
}

void shutdown_display_for_reboot() {
  ledcWrite(kBacklightPin, 0);
  if (g_panel != nullptr) {
    esp_lcd_panel_disp_on_off(g_panel, false);
  }
}

void lower_in_place(char *text) {
  for (size_t i = 0; text[i] != '\0'; ++i) {
    text[i] = static_cast<char>(std::tolower(static_cast<unsigned char>(text[i])));
  }
}

float parse_numeric_prefix(const std::string &text, bool *ok) {
  if (ok != nullptr) {
    *ok = false;
  }
  if (text.empty()) {
    return 0.0f;
  }
  if (!((text[0] >= '0' && text[0] <= '9') || text[0] == '-' || text[0] == '+')) {
    return 0.0f;
  }
  char *end = nullptr;
  const float value = strtof(text.c_str(), &end);
  if (end == text.c_str()) {
    return 0.0f;
  }
  if (ok != nullptr) {
    *ok = true;
  }
  return value;
}

bool json_extract_string(const String &json, const char *key, String *out, int from_index = 0) {
  if (out == nullptr || key == nullptr) return false;
  const String token = "\"" + String(key) + "\"";
  const int key_index = json.indexOf(token, from_index);
  if (key_index < 0) return false;
  const int colon_index = json.indexOf(':', key_index + token.length());
  if (colon_index < 0) return false;
  int value_start = colon_index + 1;
  while (value_start < static_cast<int>(json.length()) &&
         std::isspace(static_cast<unsigned char>(json[value_start]))) {
    ++value_start;
  }
  if (value_start >= static_cast<int>(json.length()) || json[value_start] != '"') return false;
  ++value_start;

  String value;
  bool escaped = false;
  for (int i = value_start; i < static_cast<int>(json.length()); ++i) {
    const char c = json[i];
    if (c == '"' && !escaped) {
      *out = value;
      return true;
    }
    if (escaped) {
      escaped = false;
    } else if (c == '\\') {
      escaped = true;
      continue;
    }
    value += c;
  }
  return false;
}

bool json_extract_float(const String &json, const char *key, float *out, int from_index = 0) {
  if (out == nullptr || key == nullptr) return false;
  const String token = "\"" + String(key) + "\"";
  const int key_index = json.indexOf(token, from_index);
  if (key_index < 0) return false;
  const int colon_index = json.indexOf(':', key_index + token.length());
  if (colon_index < 0) return false;
  int value_start = colon_index + 1;
  while (value_start < static_cast<int>(json.length()) &&
         std::isspace(static_cast<unsigned char>(json[value_start]))) {
    ++value_start;
  }
  if (value_start >= static_cast<int>(json.length())) return false;

  bool quoted = json[value_start] == '"';
  if (quoted) ++value_start;
  int value_end = value_start;
  while (value_end < static_cast<int>(json.length())) {
    const char c = json[value_end];
    if (quoted) {
      if (c == '"') break;
    } else if (c == ',' || c == '}' || std::isspace(static_cast<unsigned char>(c))) {
      break;
    }
    ++value_end;
  }
  if (value_end <= value_start) return false;
  *out = static_cast<float>(atof(json.substring(value_start, value_end).c_str()));
  return true;
}

void poll_weather(uint32_t now_ms) {
  if (g_runtime == nullptr) return;
  // Mark weather available if delivered via ESP-NOW (has_controller_weather)
  // or via MQTT (g_have_weather_data set in MQTT callback).
  if (g_runtime->has_controller_weather()) {
    if (g_runtime->last_controller_weather_ms() == 0)
      g_runtime->set_last_controller_weather_ms(now_ms);
    g_have_weather_data = true;
  }
}

bool parse_mac(const char *text, uint8_t out[6]) {
  if (text == nullptr || strlen(text) < 17) return false;
  unsigned values[6] = {};
  if (sscanf(text, "%02x:%02x:%02x:%02x:%02x:%02x", &values[0], &values[1], &values[2],
             &values[3], &values[4], &values[5]) != 6) {
    return false;
  }
  for (int i = 0; i < 6; ++i) out[i] = static_cast<uint8_t>(values[i] & 0xFFu);
  return true;
}

bool is_broadcast_mac(const uint8_t mac[6]) {
  static const uint8_t kBroadcast[6] = {0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF};
  return memcmp(mac, kBroadcast, sizeof(kBroadcast)) == 0;
}

bool parse_lmk_hex(const char *text, uint8_t out[16]) {
  if (text == nullptr || strlen(text) != 32) return false;
  for (int i = 0; i < 16; ++i) {
    unsigned byte = 0;
    if (sscanf(text + (i * 2), "%02x", &byte) != 1) return false;
    out[i] = static_cast<uint8_t>(byte & 0xFFu);
  }
  return true;
}

const char *reset_reason_text(esp_reset_reason_t reason) {
  switch (reason) {
    case ESP_RST_POWERON:
      return "power_on";
    case ESP_RST_SW:
      return "software";
    case ESP_RST_PANIC:
      return "panic";
    case ESP_RST_INT_WDT:
      return "interrupt_wdt";
    case ESP_RST_TASK_WDT:
      return "task_wdt";
    case ESP_RST_WDT:
      return "wdt";
    case ESP_RST_DEEPSLEEP:
      return "deep_sleep";
    case ESP_RST_BROWNOUT:
      return "brownout";
    case ESP_RST_SDIO:
      return "sdio";
    default:
      return "other";
  }
}

// web_ui::html_escape() and web_ui::json_escape() are now in web_ui namespace via web_ui_escape.h

void web_handle_config_get() {
  xSemaphoreTake(g_api_mutex, portMAX_DELAY);
  String body = "{";
  body += "\"wifi_ssid\":\"" + web_ui::json_escape(g_cfg_wifi_ssid) + "\",";
  body += "\"wifi_password\":\"" + String(g_cfg_wifi_password.length() > 0 ? "set" : "unset") + "\",";
  body += "\"wifi_disabled\":" + String(g_cfg_wifi_disabled ? "true" : "false") + ",";
  body += "\"mqtt_host\":\"" + web_ui::json_escape(g_cfg_mqtt_host) + "\",";
  body += "\"mqtt_port\":" + String(g_cfg_mqtt_port) + ",";
  body += "\"mqtt_user\":\"" + web_ui::json_escape(g_cfg_mqtt_user) + "\",";
  body += "\"mqtt_password\":\"" + String(g_cfg_mqtt_password.length() > 0 ? "set" : "unset") + "\",";
  body += "\"base_topic\":\"" + web_ui::json_escape(g_cfg_base_topic) + "\",";
  body += "\"discovery_prefix\":\"" + web_ui::json_escape(g_cfg_discovery_prefix) + "\",";
  body += "\"ha_discovery_enabled\":" + String(g_cfg_ha_discovery_enabled ? "true" : "false") + ",";
  body += "\"display_timeout_s\":" + String(g_display_timeout_ms / 1000UL) + ",";
  body += "\"backlight_active_pct\":" + String(g_cfg_backlight_active_pct) + ",";
  body += "\"backlight_screensaver_pct\":" + String(g_cfg_backlight_screensaver_pct) + ",";
  body += "\"temp_comp_c\":" + String(g_cfg_temp_comp_c, 2) + ",";
  body += "\"temperature_unit\":\"" + String(g_cfg_temp_unit_f ? "f" : "c") + "\",";
  body += "\"hostname\":\"" + web_ui::json_escape(g_cfg_hostname) + "\",";
  body += "\"espnow_channel\":" + String(g_cfg_espnow_channel) + ",";
  body += "\"espnow_peer_mac\":\"" + web_ui::json_escape(g_cfg_espnow_peer_mac) + "\",";
  body += "\"espnow_lmk\":\"" + String(g_cfg_espnow_lmk.length() > 0 ? "set" : "unset") + "\",";
  body += "\"paired_controller_mac\":\"" + web_ui::json_escape(controller_mac_compact()) + "\",";
  body += "\"controller_timeout_ms\":" + String(g_cfg_controller_timeout_ms) + ",";
  body += "\"reboot_required\":" + String(g_cfg_reboot_required ? "true" : "false");
  body += "}";
  xSemaphoreGive(g_api_mutex);
  g_web.send(200, "application/json", body);
}

