rgregg/esp32-wireless-thermostat/src/thermostat/esp32s3_thermostat_firmware.cpp
void web_handle_config_post() {
  int updated = 0;
  xSemaphoreTake(g_api_mutex, portMAX_DELAY);
  for (int i = 0; i < g_web.args(); ++i) {
    if (try_update_runtime_config(g_web.argName(i), g_web.arg(i).c_str())) {
      ++updated;
    }
  }
  xSemaphoreGive(g_api_mutex);
  g_web.send(200, "text/plain", "updated=" + String(updated) + "\n");
}

void web_handle_reboot_post() {
  schedule_reboot();
  g_web.send(200, "text/plain", "rebooting\n");
}

void web_handle_status_get() {
  const uint32_t now = millis();

  // Snapshot shared state under mutex before building response
  xSemaphoreTake(g_api_mutex, portMAX_DELAY);
  const uint32_t mqtt_ctrl_ms = g_mqtt_ctrl_last_update_ms;
  const uint32_t mqtt_cmd_ms = g_last_mqtt_command_ms;
  const uint32_t espnow_hb_ms = g_runtime ? g_runtime->last_controller_heartbeat_ms() : 0;
  const float remote_indoor_temp_c = g_remote_indoor_temp_c;
  const float remote_indoor_humidity = g_remote_indoor_humidity;
  const std::string indoor_temp_text = g_runtime ? g_runtime->indoor_temp_text() : std::string("");
  const std::string indoor_humidity_text = g_runtime ? g_runtime->indoor_humidity_text() : std::string("");
  const std::string setpoint_text = g_runtime ? g_runtime->setpoint_text() : std::string("");
  const std::string status_text_str = g_runtime ? g_runtime->status_text(now) : std::string("");
  const std::string weather_text_str = g_runtime ? g_runtime->weather_text() : std::string("");
  const bool have_weather = g_have_weather_data;
  const float outdoor_temp = g_outdoor_temp_c;
  const uint32_t mqtt_ctrl_applied_ms = g_mqtt_ctrl_last_applied_ms;
  const uint32_t controller_timeout = g_cfg_controller_timeout_ms;
  const String paired_ctrl_mac = controller_mac_compact();
  const FurnaceMode ctrl_mode = g_mqtt_ctrl_mode;
  const FurnaceStateCode ctrl_state = g_mqtt_ctrl_state;
  const bool ctrl_available = g_mqtt_ctrl_available;
  const SensorType sensor_type = g_sensor_type;
  const bool temp_unit_f = g_cfg_temp_unit_f;
  xSemaphoreGive(g_api_mutex);

  char buf[2048];
  char remote_temp_str[16], remote_hum_str[16];
  if (std::isnan(remote_indoor_temp_c)) {
    strcpy(remote_temp_str, "null");
  } else {
    double remote_temp_display = static_cast<double>(remote_indoor_temp_c);
    if (temp_unit_f) remote_temp_display = remote_temp_display * 9.0 / 5.0 + 32.0;
    snprintf(remote_temp_str, sizeof(remote_temp_str), "%.1f", remote_temp_display);
  }
  if (std::isnan(remote_indoor_humidity)) {
    strcpy(remote_hum_str, "null");
  } else {
    snprintf(remote_hum_str, sizeof(remote_hum_str), "%.2f", static_cast<double>(remote_indoor_humidity));
  }
  snprintf(buf, sizeof(buf),
    "{"
    "\"uptime_ms\":%lu,"
    "\"wifi_connected\":%s,"
    "\"wifi_ip\":\"%s\","
    "\"wifi_rssi\":%d,"
    "\"mqtt_connected\":%s,"
    "\"espnow_connected\":%s,"
    "\"aht_sensor_ready\":%s,"
    "\"sensor_type\":\"%s\","
    "\"remote_indoor_temp_c\":%s,"
    "\"remote_indoor_humidity\":%s,"
    "\"indoor_temp_text\":\"%s\","
    "\"indoor_humidity_text\":\"%s\","
    "\"setpoint_text\":\"%s\","
    "\"status_text\":\"%s\","
    "\"weather_text\":\"%s\","
    "\"have_weather_data\":%s,"
    "\"outdoor_temp_c\":%.1f,"
    "\"mqtt_ctrl_last_update_ms\":%lu,"
    "\"mqtt_ctrl_last_applied_ms\":%lu,"
    "\"last_mqtt_command_ms\":%lu,"
    "\"espnow_heartbeat_ms\":%lu,"
    "\"controller_timeout_ms\":%lu,"
    "\"paired_controller_mac\":\"%s\","
    "\"mqtt_ctrl_mode\":\"%s\","
    "\"mqtt_ctrl_state\":\"%s\","
    "\"mqtt_ctrl_available\":%s,"
    "\"free_heap\":%lu,"
    "\"firmware_version\":\"%s\""
    "}",
    static_cast<unsigned long>(now),
    WiFi.status() == WL_CONNECTED ? "true" : "false",
    WiFi.status() == WL_CONNECTED ? WiFi.localIP().toString().c_str() : "",
    WiFi.status() == WL_CONNECTED ? WiFi.RSSI() : 0,
    g_mqtt.connected() ? "true" : "false",
    (espnow_hb_ms > 0 && (now - espnow_hb_ms) < 30000UL) ? "true" : "false",
    sensor_type != SensorType::None ? "true" : "false",
    sensor_type == SensorType::AHT ? "aht" :
    sensor_type == SensorType::Si7021 ? "si7021" : "none",
    remote_temp_str,
    remote_hum_str,
    indoor_temp_text.c_str(),
    indoor_humidity_text.c_str(),
    setpoint_text.c_str(),
    status_text_str.c_str(),
    weather_text_str.c_str(),
    have_weather ? "true" : "false",
    static_cast<double>(outdoor_temp),
    static_cast<unsigned long>(mqtt_ctrl_ms),
    static_cast<unsigned long>(mqtt_ctrl_applied_ms),
    static_cast<unsigned long>(mqtt_cmd_ms),
    static_cast<unsigned long>(espnow_hb_ms),
    static_cast<unsigned long>(controller_timeout),
    paired_ctrl_mac.c_str(),
    mqtt_payload::mode_to_str(ctrl_mode),
    mqtt_payload::furnace_state_to_str(ctrl_state),
    ctrl_available ? "true" : "false",
    static_cast<unsigned long>(ESP.getFreeHeap()),
    THERMOSTAT_FIRMWARE_VERSION
  );
  g_web.send(200, "application/json", buf);
}

void write_u16_le(uint8_t *out, uint16_t value) {
  out[0] = static_cast<uint8_t>(value & 0xFFu);
  out[1] = static_cast<uint8_t>((value >> 8) & 0xFFu);
}

void write_u32_le(uint8_t *out, uint32_t value) {
  out[0] = static_cast<uint8_t>(value & 0xFFu);
  out[1] = static_cast<uint8_t>((value >> 8) & 0xFFu);
  out[2] = static_cast<uint8_t>((value >> 16) & 0xFFu);
  out[3] = static_cast<uint8_t>((value >> 24) & 0xFFu);
}

void web_handle_screenshot() {
  if (g_buf_1 == nullptr || g_buf_2 == nullptr) {
    g_web.send(503, "text/plain", "display not initialized");
    return;
  }

  // Copy the framebuffer that LVGL last finished drawing into PSRAM,
  // then stream from the snapshot — no mutex held during the slow I/O.
  const size_t frame_bytes = kDisplayWidth * kDisplayHeight * sizeof(lv_color_t);
  uint8_t *snap = static_cast<uint8_t *>(heap_caps_malloc(frame_bytes, MALLOC_CAP_SPIRAM));

  const uint16_t *fb;
  if (snap) {
    xSemaphoreTake(g_api_mutex, portMAX_DELAY);
    // buf_act is the buffer LVGL draws into next; the other holds the last complete frame
    const lv_color_t *src = (g_draw_buf.buf_act == g_buf_1) ? g_buf_2 : g_buf_1;
    memcpy(snap, src, frame_bytes);
    xSemaphoreGive(g_api_mutex);
    fb = reinterpret_cast<const uint16_t *>(snap);
  } else {
    // Fallback: stream live buffer directly (rare OOM; minor tearing acceptable)
    fb = reinterpret_cast<const uint16_t *>(
        g_draw_buf.buf_act == g_buf_1 ? g_buf_2 : g_buf_1);
  }

  const uint32_t row_size = ((kDisplayWidth * 3U) + 3U) & ~3U;
  const uint32_t image_size = row_size * kDisplayHeight;
  const uint32_t file_size = 54U + image_size;

  g_web.setContentLength(file_size);
  g_web.send(200, "image/bmp", "");
  WiFiClient client = g_web.client();

