rgregg/esp32-wireless-thermostat/src/thermostat/esp32s3_thermostat_firmware.cpp
  uint8_t header[54] = {0};
  header[0] = 'B';
  header[1] = 'M';
  write_u32_le(&header[2], file_size);
  write_u32_le(&header[10], 54U);
  write_u32_le(&header[14], 40U);
  write_u32_le(&header[18], static_cast<uint32_t>(kDisplayWidth));
  write_u32_le(&header[22], static_cast<uint32_t>(kDisplayHeight));
  write_u16_le(&header[26], 1U);
  write_u16_le(&header[28], 24U);
  write_u32_le(&header[34], image_size);
  client.write(header, sizeof(header));

  static uint8_t row[((kDisplayWidth * 3U) + 3U) & ~3U];
  for (int y = kDisplayHeight - 1; y >= 0; --y) {
    uint32_t idx = 0;
    for (int x = 0; x < kDisplayWidth; ++x) {
      const uint16_t px = fb[(y * kDisplayWidth) + x];
      const uint8_t r = static_cast<uint8_t>(((px >> 11) & 0x1F) * 255 / 31);
      const uint8_t g = static_cast<uint8_t>(((px >> 5) & 0x3F) * 255 / 63);
      const uint8_t b = static_cast<uint8_t>((px & 0x1F) * 255 / 31);
      row[idx++] = b;
      row[idx++] = g;
      row[idx++] = r;
    }
    while (idx < row_size) {
      row[idx++] = 0;
    }
    client.write(row, row_size);
  }

  if (snap) {
    heap_caps_free(snap);
  }
}

void web_handle_devices_get() {
  xSemaphoreTake(g_api_mutex, portMAX_DELAY);
  DeviceRegistry snapshot = g_device_registry;
  xSemaphoreGive(g_api_mutex);

  String json = "[";
  bool first = true;
  for (size_t i = 0; i < kMaxRegistryEntries; ++i) {
    const auto &e = snapshot.entries[i];
    if (!e.occupied) continue;
    if (!first) json += ',';
    first = false;
    json += "{\"mac\":\"";
    json += web_ui::json_escape(e.mac);
    json += "\",\"name\":\"";
    json += web_ui::json_escape(e.name);
    json += "\",\"type\":\"";
    json += web_ui::json_escape(e.type);
    json += "\",\"ip\":\"";
    json += web_ui::json_escape(e.ip);
    json += "\"}";
  }
  json += "]";
  g_web.send(200, "application/json", json);
}

void web_handle_root() {
  using namespace web_ui;

  // Snapshot config globals under mutex (brief hold), then build HTML outside
  xSemaphoreTake(g_api_mutex, portMAX_DELAY);
  const String ota_hostname = g_cfg_hostname;
  const bool reboot_required = g_cfg_reboot_required;
  const String wifi_ssid = g_cfg_wifi_ssid;
  const bool wifi_pwd_set = g_cfg_wifi_password.length() > 0;
  const String mqtt_host = g_cfg_mqtt_host;
  const uint16_t mqtt_port = g_cfg_mqtt_port;
  const String mqtt_user = g_cfg_mqtt_user;
  const bool mqtt_pwd_set = g_cfg_mqtt_password.length() > 0;
  const String base_topic = g_cfg_base_topic;
  const bool ha_disc_enabled = g_cfg_ha_discovery_enabled;
  const String paired_ctrl_mac = controller_mac_compact();
  const String disc_prefix = g_cfg_discovery_prefix;
  const uint8_t espnow_channel = g_cfg_espnow_channel;
  const String espnow_peer_mac = g_cfg_espnow_peer_mac;
  const bool espnow_lmk_set = g_cfg_espnow_lmk.length() > 0;
  const uint32_t display_timeout_s = g_display_timeout_ms / 1000UL;
  const uint8_t bl_active = g_cfg_backlight_active_pct;
  const uint8_t bl_saver = g_cfg_backlight_screensaver_pct;
  const bool temp_unit_f = g_cfg_temp_unit_f;
  const float temp_comp = g_cfg_temp_comp_c;
  const uint32_t ctrl_timeout = g_cfg_controller_timeout_ms;
  const bool mqtt_enabled = g_cfg_mqtt_enabled;
  const bool espnow_enabled = g_cfg_espnow_enabled;
  xSemaphoreGive(g_api_mutex);

  String html;
  html.reserve(12288);

  static const TabDef tabs[] = {
    {"status", "Status"},
    {"wifi", "WiFi"},
    {"mqtt", "MQTT"},
    {"display", "Display"},
    {"hw", "Hardware"},
    {"system", "System"},
  };
  page_begin(html, "Thermostat Display", ota_hostname.c_str(),
             tabs, sizeof(tabs) / sizeof(tabs[0]));

  // ── Status tab ──
  tab_begin(html, "status", true);
  card_begin(html, "Display Status");
  status_grid_begin(html);
  status_section(html, "Connectivity");
  status_item(html, "WiFi", "wifi_connected");
  status_item(html, "IP Address", "wifi_ip");
  status_item(html, "RSSI", "wifi_rssi");
  status_item(html, "MQTT", "mqtt_connected");
  status_item(html, "ESP-NOW", "espnow_connected");
  status_section(html, "Environment");
  status_item(html, "Sensor", "sensor_type");
  status_item(html, temp_unit_f ? "Remote Temp (\xc2\xb0""F)" : "Remote Temp (\xc2\xb0""C)", "remote_indoor_temp_c");
  status_item(html, "Remote Humidity", "remote_indoor_humidity");
  status_item(html, "Indoor Temp", "indoor_temp_text");
  status_item(html, "Indoor Humidity", "indoor_humidity_text");
  status_item(html, "Setpoint", "setpoint_text");
  status_item(html, "Weather", "weather_text");
  status_section(html, "Controller");
  status_item(html, "Status", "status_text");
  status_item(html, "Mode", "mqtt_ctrl_mode");
  status_item(html, "State", "mqtt_ctrl_state");
  status_item(html, "Available", "mqtt_ctrl_available");
  status_section(html, "System");
  status_item(html, "Free Heap", "free_heap");
  status_item(html, "Uptime", "uptime_ms");
  status_item(html, "Firmware", "firmware_version");
  status_grid_end(html);
  card_end(html);
  if (reboot_required) {
    html += F("<div class=\"card\" style=\"border:1px solid var(--wn)\">"
              "<p style=\"color:var(--wn)\">Reboot required for pending changes.</p></div>");
  }
  tab_end(html);

  // ── WiFi tab ──
  tab_begin(html, "wifi");
  card_begin(html, "WiFi Settings");
  form_begin(html);
  text_field(html, "WiFi SSID", "wifi_ssid", wifi_ssid, nullptr, nullptr, nullptr, 64);
  password_field(html, "WiFi Password", "wifi_password", wifi_pwd_set);
  form_end(html, "Save WiFi");
  card_end(html);
  tab_end(html);

  // ── MQTT tab ──
  tab_begin(html, "mqtt");
  card_begin(html, "MQTT Broker");
  form_begin(html);
  text_field(html, "Broker Host", "mqtt_host", mqtt_host);
  number_field(html, "Broker Port", "mqtt_port", String(mqtt_port), "1", "65535", "1");
  text_field(html, "Username", "mqtt_user", mqtt_user);
  password_field(html, "Password", "mqtt_password", mqtt_pwd_set);
  text_field(html, "Base Topic", "base_topic", base_topic,
             "e.g. esp32-wireless-thermostat");
  checkbox_field(html, "HA Discovery", "ha_discovery_enabled", ha_disc_enabled,
                 "ha-disc-opts");
  html += F("<div id=\"ha-disc-opts\"");
  if (!ha_disc_enabled) html += F(" style=\"display:none\"");
  html += F(">");
  text_field(html, "Discovery Prefix", "discovery_prefix", disc_prefix,
             "HA MQTT discovery prefix, e.g. homeassistant");
  html += F("</div>");
  form_end(html, "Save MQTT");
  card_end(html);
  tab_end(html);

  // ── Display tab ──
  tab_begin(html, "display");
  card_begin(html, "Screen Settings");
  form_begin(html);
  number_field(html, "Screen Timeout (seconds)", "display_timeout_s",
               String(display_timeout_s), "30", "600", "1");
  number_field(html, "Active Brightness (%)", "backlight_active_pct",
               String(bl_active), "0", "100", "1");
  number_field(html, "Screensaver Brightness (%)", "backlight_screensaver_pct",
               String(bl_saver), "0", "100", "1");
  {
    static const SelectOption temp_opts[] = {{"c", "Celsius"}, {"f", "Fahrenheit"}};
    select_field(html, "Temperature Unit", "temperature_unit",
                 temp_opts, 2, String(temp_unit_f ? "f" : "c"));
  }
  form_end(html, "Save Display");
  card_end(html);
  tab_end(html);

  // ── Hardware tab ──
  tab_begin(html, "hw");

  // Device card
  card_begin(html, "Device");
  form_begin(html);
  text_field(html, "Hostname", "hostname", ota_hostname,
             "Used for mDNS, DHCP, and MQTT device name",
             "^[a-zA-Z0-9]([a-zA-Z0-9-]*[a-zA-Z0-9])?$",
             "Letters, digits, hyphens; max 63 chars", 63);
  form_end(html, "Save");
  card_end(html);

  // Controller card
  card_begin(html, "Controller");
  form_begin(html);
  mac_field(html, "Controller MAC", "espnow_peer_mac", espnow_peer_mac);
  form_end(html, "Save");
  card_end(html);

