rgregg/esp32-wireless-thermostat/src/thermostat/esp32s3_thermostat_firmware.cpp
  // Transport card
  card_begin(html, "Transport");
  form_begin(html);
  checkbox_field(html, "Enable MQTT", "mqtt_enabled", mqtt_enabled);
  checkbox_field(html, "Enable ESP-NOW", "espnow_enabled", espnow_enabled);
  form_end(html, "Save");
  card_end(html);

  // ESP-NOW Settings card
  card_begin(html, "ESP-NOW Settings");
  form_begin(html);
  number_field(html, "Channel", "espnow_channel", String(espnow_channel), "1", "14", "1");
  password_field(html, "Encryption Key (LMK)", "espnow_lmk",
                 espnow_lmk_set,
                 "^[0-9A-Fa-f]{32}$", "32 hex characters");
  form_end(html, "Save ESP-NOW");
  card_end(html);

  // Sensor card
  card_begin(html, "Sensor");
  form_begin(html);
  {
    float comp_display = temp_unit_f ? temp_comp * 1.8f : temp_comp;
    number_field(html, temp_unit_f ? "Temp Compensation (\xc2\xb0""F)" : "Temp Compensation (\xc2\xb0""C)",
                 "temp_comp", String(comp_display, 2),
                 temp_unit_f ? "-18" : "-10", temp_unit_f ? "18" : "10", "0.01",
                 "Offset applied to AHT sensor readings");
  }
  number_field(html, "Controller Timeout (ms)", "controller_timeout_ms",
               String(ctrl_timeout), "1000", "600000", "1",
               "Time before controller is considered disconnected");
  form_end(html, "Save");
  card_end(html);

  tab_end(html);

  // ── System tab ──
  tab_begin(html, "system");
  card_begin(html, "Firmware Update");
  html += F("<form method=\"post\" action=\"/update\" enctype=\"multipart/form-data\">");
  file_upload(html);
  html += F("<div class=\"mt\"><button type=\"submit\" class=\"btn btn-p\">Upload Firmware</button></div>");
  html += F("</form>");
  card_end(html);

  card_begin(html, "Device Control");
  reboot_button(html, "Reboot Display");
  card_end(html);

  card_begin(html, "Screenshot");
  html += F("<p><img id=\"scr\" data-src=\"/screenshot\" style=\"max-width:100%;border-radius:0.375rem\"></p>");
  card_end(html);

  card_begin(html, "Links");
  html += F("<p style=\"font-size:0.85rem\"><a href=\"/config\" style=\"color:var(--ac)\">JSON Config</a>"
            " &middot; <a href=\"/status\" style=\"color:var(--ac)\">JSON Status</a>"
            " &middot; <a href=\"/screenshot\" style=\"color:var(--ac)\">Screenshot (BMP)</a></p>");
  card_end(html);
  tab_end(html);

  page_end(html);
  g_web.send(200, "text/html", html);
}

static void web_server_task(void *) {
  // Wait for the web server to be configured and started.
  // Use a longer delay to minimise Core 0 contention during WiFi connect.
  while (!g_web_started) {
    vTaskDelay(pdMS_TO_TICKS(500));
  }
  while (true) {
    g_web.handleClient();
    ota_web_loop();
    vTaskDelay(pdMS_TO_TICKS(5));
  }
}

void ensure_web_ready() {
  if (WiFi.status() != WL_CONNECTED) return;
  if (!g_web_started) {
    g_web.on("/", HTTP_GET, web_handle_root);
    g_web.on("/status", HTTP_GET, web_handle_status_get);
    g_web.on("/devices", HTTP_GET, web_handle_devices_get);
    g_web.on("/config", HTTP_GET, web_handle_config_get);
    g_web.on("/config", HTTP_POST, web_handle_config_post);
    g_web.on("/reboot", HTTP_POST, web_handle_reboot_post);
    g_web.on("/screenshot", HTTP_GET, web_handle_screenshot);
    ota_web_setup(g_web);
    ota_set_prepare_callback([]() {
      // Close the MQTT TCP socket immediately to free ~5-6KB of internal SRAM
      // socket buffers before any OTA data arrives.  We call stop() on the
      // raw WiFiClient (lwip socket close) rather than PubSubClient::disconnect()
      // which is not thread-safe across cores.  The main loop does full teardown.
      g_wifi_client.stop();
      Serial.printf("[ota] prepare: closed MQTT socket, heap=%u internal=%u\n",
                    ESP.getFreeHeap(),
                    heap_caps_get_free_size(MALLOC_CAP_INTERNAL));
    });
    g_web.begin();
    g_web_started = true;
  }
}

std::string current_time_text() {
  time_t now = time(nullptr);
  if (now < 1700000000L) {
    return "--:--";
  }
  struct tm local_tm {};
  localtime_r(&now, &local_tm);
  char buf[24];
  strftime(buf, sizeof(buf), "%I:%M %p", &local_tm);
  return std::string(buf[0] == '0' ? buf + 1 : buf);
}

std::string current_date_text() {
  time_t now = time(nullptr);
  if (now < 1700000000L) {
    return "--- date ---";
  }
  struct tm local_tm {};
  localtime_r(&now, &local_tm);
  char buf[32];
  strftime(buf, sizeof(buf), "%A, %b %d", &local_tm);
  return std::string(buf);
}

void mqtt_publish_state() {
  if (g_runtime == nullptr || !g_mqtt.connected()) return;

  const uint32_t now = millis();

  g_mqtt.publish(self_topic_for("state/availability").c_str(), "online", true);
  g_mqtt.publish(self_topic_for("state/mode").c_str(), mqtt_payload::mode_to_str(g_runtime->local_mode()), true);
  g_mqtt.publish(self_topic_for("state/fan_mode").c_str(), mqtt_payload::fan_to_str(g_runtime->local_fan_mode()),
                 true);

  char buf[32];
  snprintf(buf, sizeof(buf), "%.1f", g_runtime->local_setpoint_c());
  g_mqtt.publish(self_topic_for("state/target_temp_c").c_str(), buf, true);
  if (g_runtime->has_last_packed_command()) {
    snprintf(buf, sizeof(buf), "%lu",
             static_cast<unsigned long>(g_runtime->last_packed_command()));
    g_mqtt.publish(self_topic_for("state/packed_command").c_str(), buf, false);
    snprintf(buf, sizeof(buf), "%u", static_cast<unsigned>(g_runtime->last_command_seq()));
    g_mqtt.publish(self_topic_for("state/command_seq").c_str(), buf, false);
  }

  snprintf(buf, sizeof(buf), "%.2f", g_runtime->local_temperature_compensation_c());
  g_mqtt.publish(self_topic_for("state/temp_comp_c").c_str(), buf, true);
  snprintf(buf, sizeof(buf), "%lu", static_cast<unsigned long>(g_display_timeout_ms / 1000UL));
  g_mqtt.publish(self_topic_for("state/display_timeout_s").c_str(), buf, true);
  snprintf(buf, sizeof(buf), "%u", static_cast<unsigned>(g_cfg_backlight_active_pct));
  g_mqtt.publish(self_topic_for("state/backlight_active_pct").c_str(), buf, true);
  snprintf(buf, sizeof(buf), "%u", static_cast<unsigned>(g_cfg_backlight_screensaver_pct));
  g_mqtt.publish(self_topic_for("state/backlight_screensaver_pct").c_str(), buf, true);
  g_mqtt.publish(self_topic_for("state/firmware_version").c_str(), THERMOSTAT_FIRMWARE_VERSION, true);
  snprintf(buf, sizeof(buf), "%lu", static_cast<unsigned long>(g_boot_count));
  g_mqtt.publish(self_topic_for("state/boot_count").c_str(), buf, true);
  g_mqtt.publish(self_topic_for("state/reset_reason").c_str(), g_reset_reason.c_str(), true);
  snprintf(buf, sizeof(buf), "%lu", static_cast<unsigned long>(millis() / 1000UL));
  g_mqtt.publish(self_topic_for("state/uptime_s").c_str(), buf, true);
  snprintf(buf, sizeof(buf), "%lu", static_cast<unsigned long>(g_last_mqtt_command_ms));
  g_mqtt.publish(self_topic_for("state/last_mqtt_command_ms").c_str(), buf, true);
  snprintf(buf, sizeof(buf), "%lu",
           static_cast<unsigned long>(g_runtime->last_controller_heartbeat_ms()));
  g_mqtt.publish(self_topic_for("state/last_espnow_rx_ms").c_str(), buf, true);
  snprintf(buf, sizeof(buf), "%lu",
           static_cast<unsigned long>(g_runtime->espnow_send_ok_count()));
  g_mqtt.publish(self_topic_for("state/espnow_send_ok_count").c_str(), buf, true);
  snprintf(buf, sizeof(buf), "%lu",
           static_cast<unsigned long>(g_runtime->espnow_send_fail_count()));
  g_mqtt.publish(self_topic_for("state/espnow_send_fail_count").c_str(), buf, true);
  if (g_last_espnow_error != "begin_failed") {
    g_last_espnow_error = g_runtime->espnow_send_fail_count() > 0 ? "send_failed" : "none";
  }
  snprintf(buf, sizeof(buf), "%lu",
           static_cast<unsigned long>(esp_get_free_heap_size()));
  g_mqtt.publish(self_topic_for("state/free_heap_bytes").c_str(), buf, true);
  g_mqtt.publish(self_topic_for("state/error_mqtt").c_str(), g_last_mqtt_error.c_str(), true);
  g_mqtt.publish(self_topic_for("state/error_ota").c_str(), g_last_ota_error.c_str(), true);
  g_mqtt.publish(self_topic_for("state/error_espnow").c_str(), g_last_espnow_error.c_str(), true);

  {
    const uint32_t now_ms = millis();
    const uint32_t mqtt_ms = std::max(g_last_mqtt_command_ms, g_mqtt_ctrl_last_update_ms);
    const uint32_t espnow_ms = g_runtime->last_controller_heartbeat_ms();
    const bool mqtt_active = mqtt_ms > 0 && (now_ms - mqtt_ms) < g_cfg_controller_timeout_ms;
    const bool espnow_active = espnow_ms > 0 && (now_ms - espnow_ms) < g_cfg_controller_timeout_ms;
    const char *path = espnow_active && mqtt_active ? "mqtt+esp-now"
                       : mqtt_active                ? "mqtt"
                       : espnow_active              ? "esp-now"
                                                    : "disconnected";
    g_mqtt.publish(self_topic_for("state/connection_path").c_str(), path, true);
  }

  if (WiFi.status() == WL_CONNECTED) {
    g_mqtt.publish(self_topic_for("state/wifi_ip").c_str(), WiFi.localIP().toString().c_str(), true);
    g_mqtt.publish(self_topic_for("state/wifi_mac").c_str(), WiFi.macAddress().c_str(), true);
    g_mqtt.publish(self_topic_for("state/wifi_ssid").c_str(), WiFi.SSID().c_str(), true);
    snprintf(buf, sizeof(buf), "%d", WiFi.channel());
    g_mqtt.publish(self_topic_for("state/wifi_channel").c_str(), buf, true);
    snprintf(buf, sizeof(buf), "%d", WiFi.RSSI());
    g_mqtt.publish(self_topic_for("state/wifi_rssi").c_str(), buf, true);
  }

  const float indoor_c = g_runtime->local_indoor_temperature_c();
  const bool ok_temp = std::isfinite(indoor_c);
  if (ok_temp) {
    snprintf(buf, sizeof(buf), "%.2f", indoor_c);
    g_mqtt.publish(self_topic_for("state/current_temp_c").c_str(), buf, true);
  }

  const float indoor_h = g_runtime->local_indoor_humidity();
  const bool ok_humidity = std::isfinite(indoor_h);
  if (ok_humidity) {
    snprintf(buf, sizeof(buf), "%.2f", indoor_h);
    g_mqtt.publish(self_topic_for("state/current_humidity").c_str(), buf, true);
  }

