rgregg/esp32-wireless-thermostat/src/thermostat/esp32s3_thermostat_firmware.cpp
  // Publish local sensor data under own device path.
  if (g_sensor_type != SensorType::None) {
    if (ok_temp) {
      snprintf(buf, sizeof(buf), "%.2f", indoor_c);
      g_mqtt.publish(self_topic_for("sensor/temp_c").c_str(), buf, false);
    }
    if (ok_humidity) {
      snprintf(buf, sizeof(buf), "%.2f", indoor_h);
      g_mqtt.publish(self_topic_for("sensor/humidity").c_str(), buf, false);
    }
  }

  g_mqtt.publish(self_topic_for("state/status").c_str(), g_runtime->status_text(now).c_str(), true);
}

void mqtt_publish_discovery() {
  if (!g_mqtt.connected() || g_mqtt_discovery_sent) return;

  const String base = g_cfg_base_topic + "/devices/" + g_cfg_device_mac_compact;
  const String node = g_cfg_base_topic + "_" + g_cfg_device_mac_compact + "_display";

  // Climate entity is now published by the controller. Display publishes only
  // display-specific entities (timeout, brightness, diagnostics).

  char payload[1500];
  const String timeout_config = g_cfg_discovery_prefix + "/number/" + node +
                                "_display_timeout/config";
  snprintf(payload, sizeof(payload),
           "{\"name\":\"Display Timeout\",\"uniq_id\":\"%s_display_timeout\","
           "\"cmd_t\":\"%s/cmd/display_timeout_s\",\"stat_t\":\"%s/state/display_timeout_s\","
           "\"min\":30,\"max\":600,\"step\":5,\"mode\":\"box\",\"unit_of_meas\":\"s\","
           "\"entity_category\":\"config\",\"dev\":{\"ids\":[\"%s\"],\"name\":\"%s\","
           "\"mf\":\"rgregg\",\"mdl\":\"ESP32 Thermostat\"}}",
           node.c_str(), base.c_str(), base.c_str(), node.c_str(),
           g_cfg_hostname.c_str());
  g_mqtt.publish(timeout_config.c_str(), payload, true);

  const String brightness_config = g_cfg_discovery_prefix + "/number/" + node +
                                   "_display_backlight_active/config";
  snprintf(payload, sizeof(payload),
           "{\"name\":\"Display Brightness\",\"uniq_id\":\"%s_display_backlight_active\","
           "\"cmd_t\":\"%s/cmd/backlight_active_pct\","
           "\"stat_t\":\"%s/state/backlight_active_pct\","
           "\"min\":0,\"max\":100,\"step\":1,\"mode\":\"box\",\"unit_of_meas\":\"%%\","
           "\"entity_category\":\"config\",\"dev\":{\"ids\":[\"%s\"]}}",
           node.c_str(), base.c_str(), base.c_str(), node.c_str());
  g_mqtt.publish(brightness_config.c_str(), payload, true);

  const String dim_brightness_config = g_cfg_discovery_prefix + "/number/" + node +
                                       "_display_backlight_screensaver/config";
  snprintf(payload, sizeof(payload),
           "{\"name\":\"Screensaver Brightness\","
           "\"uniq_id\":\"%s_display_backlight_screensaver\","
           "\"cmd_t\":\"%s/cmd/backlight_screensaver_pct\","
           "\"stat_t\":\"%s/state/backlight_screensaver_pct\","
           "\"min\":0,\"max\":100,\"step\":1,\"mode\":\"box\",\"unit_of_meas\":\"%%\","
           "\"entity_category\":\"config\",\"dev\":{\"ids\":[\"%s\"]}}",
           node.c_str(), base.c_str(), base.c_str(), node.c_str());
  g_mqtt.publish(dim_brightness_config.c_str(), payload, true);

  const String fw_config = g_cfg_discovery_prefix + "/sensor/" + node + "_firmware/config";
  snprintf(payload, sizeof(payload),
           "{\"name\":\"Firmware Version\",\"uniq_id\":\"%s_firmware\",\"stat_t\":\"%s/state/firmware_version\","
           "\"entity_category\":\"diagnostic\",\"dev\":{\"ids\":[\"%s\"]}}",
           node.c_str(), base.c_str(), node.c_str());
  g_mqtt.publish(fw_config.c_str(), payload, true);

  const String rssi_config =
      g_cfg_discovery_prefix + "/sensor/" + node + "_display_wifi_rssi/config";
  snprintf(payload, sizeof(payload),
           "{\"name\":\"Display WiFi RSSI\",\"uniq_id\":\"%s_display_wifi_rssi\","
           "\"stat_t\":\"%s/state/wifi_rssi\",\"unit_of_meas\":\"dBm\","
           "\"dev_cla\":\"signal_strength\",\"stat_cla\":\"measurement\","
           "\"entity_category\":\"diagnostic\",\"en\":false,\"dev\":{\"ids\":[\"%s\"]}}",
           node.c_str(), base.c_str(), node.c_str());
  g_mqtt.publish(rssi_config.c_str(), payload, true);

  const String ip_config =
      g_cfg_discovery_prefix + "/sensor/" + node + "_display_ip/config";
  snprintf(payload, sizeof(payload),
           "{\"name\":\"Display IP Address\",\"uniq_id\":\"%s_display_ip\","
           "\"stat_t\":\"%s/state/wifi_ip\",\"icon\":\"mdi:ip-network\","
           "\"entity_category\":\"diagnostic\",\"dev\":{\"ids\":[\"%s\"]}}",
           node.c_str(), base.c_str(), node.c_str());
  g_mqtt.publish(ip_config.c_str(), payload, true);

  const String conn_path_config =
      g_cfg_discovery_prefix + "/sensor/" + node + "_display_connection_path/config";
  snprintf(payload, sizeof(payload),
           "{\"name\":\"Display Connection Path\",\"uniq_id\":\"%s_display_connection_path\","
           "\"stat_t\":\"%s/state/connection_path\",\"icon\":\"mdi:connection\","
           "\"entity_category\":\"diagnostic\",\"dev\":{\"ids\":[\"%s\"]}}",
           node.c_str(), base.c_str(), node.c_str());
  g_mqtt.publish(conn_path_config.c_str(), payload, true);

  const String heap_config =
      g_cfg_discovery_prefix + "/sensor/" + node + "_display_free_heap/config";
  snprintf(payload, sizeof(payload),
           "{\"name\":\"Display Free Heap\",\"uniq_id\":\"%s_display_free_heap\","
           "\"stat_t\":\"%s/state/free_heap_bytes\",\"unit_of_meas\":\"B\","
           "\"entity_category\":\"diagnostic\",\"en\":false,\"dev\":{\"ids\":[\"%s\"]}}",
           node.c_str(), base.c_str(), node.c_str());
  g_mqtt.publish(heap_config.c_str(), payload, true);

  const String last_mqtt_cmd_config =
      g_cfg_discovery_prefix + "/sensor/" + node + "_display_last_mqtt_command/config";
  snprintf(payload, sizeof(payload),
           "{\"name\":\"Display Last MQTT Command\",\"uniq_id\":\"%s_display_last_mqtt_command\","
           "\"stat_t\":\"%s/state/last_mqtt_command_ms\",\"unit_of_meas\":\"ms\","
           "\"entity_category\":\"diagnostic\",\"en\":false,\"dev\":{\"ids\":[\"%s\"]}}",
           node.c_str(), base.c_str(), node.c_str());
  g_mqtt.publish(last_mqtt_cmd_config.c_str(), payload, true);

  const String last_espnow_rx_config =
      g_cfg_discovery_prefix + "/sensor/" + node + "_display_last_espnow_rx/config";
  snprintf(payload, sizeof(payload),
           "{\"name\":\"Display Last ESP-NOW RX\",\"uniq_id\":\"%s_display_last_espnow_rx\","
           "\"stat_t\":\"%s/state/last_espnow_rx_ms\",\"unit_of_meas\":\"ms\","
           "\"entity_category\":\"diagnostic\",\"en\":false,\"dev\":{\"ids\":[\"%s\"]}}",
           node.c_str(), base.c_str(), node.c_str());
  g_mqtt.publish(last_espnow_rx_config.c_str(), payload, true);

  const String espnow_ok_config =
      g_cfg_discovery_prefix + "/sensor/" + node + "_display_espnow_send_ok/config";
  snprintf(payload, sizeof(payload),
           "{\"name\":\"Display ESP-NOW Send OK\",\"uniq_id\":\"%s_display_espnow_send_ok\","
           "\"stat_t\":\"%s/state/espnow_send_ok_count\",\"icon\":\"mdi:counter\","
           "\"entity_category\":\"diagnostic\",\"en\":false,\"dev\":{\"ids\":[\"%s\"]}}",
           node.c_str(), base.c_str(), node.c_str());
  g_mqtt.publish(espnow_ok_config.c_str(), payload, true);

