rgregg/esp32-wireless-thermostat/src/thermostat/esp32s3_thermostat_firmware.cpp
  const String espnow_fail_config =
      g_cfg_discovery_prefix + "/sensor/" + node + "_display_espnow_send_fail/config";
  snprintf(payload, sizeof(payload),
           "{\"name\":\"Display ESP-NOW Send Fail\",\"uniq_id\":\"%s_display_espnow_send_fail\","
           "\"stat_t\":\"%s/state/espnow_send_fail_count\",\"icon\":\"mdi:counter\","
           "\"entity_category\":\"diagnostic\",\"en\":false,\"dev\":{\"ids\":[\"%s\"]}}",
           node.c_str(), base.c_str(), node.c_str());
  g_mqtt.publish(espnow_fail_config.c_str(), payload, true);

  const String err_mqtt_config =
      g_cfg_discovery_prefix + "/sensor/" + node + "_display_error_mqtt/config";
  snprintf(payload, sizeof(payload),
           "{\"name\":\"Display MQTT Error\",\"uniq_id\":\"%s_display_error_mqtt\","
           "\"stat_t\":\"%s/state/error_mqtt\",\"entity_category\":\"diagnostic\","
           "\"dev\":{\"ids\":[\"%s\"]}}",
           node.c_str(), base.c_str(), node.c_str());
  g_mqtt.publish(err_mqtt_config.c_str(), payload, true);

  const String err_ota_config =
      g_cfg_discovery_prefix + "/sensor/" + node + "_display_error_ota/config";
  snprintf(payload, sizeof(payload),
           "{\"name\":\"Display OTA Error\",\"uniq_id\":\"%s_display_error_ota\","
           "\"stat_t\":\"%s/state/error_ota\",\"entity_category\":\"diagnostic\","
           "\"dev\":{\"ids\":[\"%s\"]}}",
           node.c_str(), base.c_str(), node.c_str());
  g_mqtt.publish(err_ota_config.c_str(), payload, true);

  const String err_espnow_config =
      g_cfg_discovery_prefix + "/sensor/" + node + "_display_error_espnow/config";
  snprintf(payload, sizeof(payload),
           "{\"name\":\"Display ESP-NOW Error\",\"uniq_id\":\"%s_display_error_espnow\","
           "\"stat_t\":\"%s/state/error_espnow\",\"entity_category\":\"diagnostic\","
           "\"dev\":{\"ids\":[\"%s\"]}}",
           node.c_str(), base.c_str(), node.c_str());
  g_mqtt.publish(err_espnow_config.c_str(), payload, true);

  const String reset_seq_config =
      g_cfg_discovery_prefix + "/button/" + node + "_display_reset_sequence/config";
  snprintf(payload, sizeof(payload),
           "{\"name\":\"Display Reset Command Sequence\","
           "\"uniq_id\":\"%s_display_reset_sequence\","
           "\"cmd_t\":\"%s/cmd/reset_sequence\",\"pl_prs\":\"1\","
           "\"entity_category\":\"diagnostic\",\"dev\":{\"ids\":[\"%s\"]}}",
           node.c_str(), base.c_str(), node.c_str());
  g_mqtt.publish(reset_seq_config.c_str(), payload, true);

  const String reboot_config =
      g_cfg_discovery_prefix + "/button/" + node + "_display_reboot/config";
  snprintf(payload, sizeof(payload),
           "{\"name\":\"Display Reboot\","
           "\"uniq_id\":\"%s_display_reboot\","
           "\"cmd_t\":\"%s/cmd/reboot\",\"pl_prs\":\"1\","
           "\"entity_category\":\"diagnostic\",\"dev\":{\"ids\":[\"%s\"]}}",
           node.c_str(), base.c_str(), node.c_str());
  g_mqtt.publish(reboot_config.c_str(), payload, true);

  const String temp_config =
      g_cfg_discovery_prefix + "/sensor/" + node + "_indoor_temperature/config";
  snprintf(payload, sizeof(payload),
           "{\"name\":\"Indoor Temperature\",\"uniq_id\":\"%s_indoor_temperature\","
           "\"stat_t\":\"%s/state/current_temp_c\",\"unit_of_meas\":\"\xC2\xB0""C\","
           "\"dev_cla\":\"temperature\",\"stat_cla\":\"measurement\","
           "\"dev\":{\"ids\":[\"%s\"],\"name\":\"%s\","
           "\"mf\":\"rgregg\",\"mdl\":\"ESP32 Thermostat\"}}",
           node.c_str(), base.c_str(), node.c_str(),
           g_cfg_hostname.c_str());
  g_mqtt.publish(temp_config.c_str(), payload, true);

  const String hum_config =
      g_cfg_discovery_prefix + "/sensor/" + node + "_indoor_humidity/config";
  snprintf(payload, sizeof(payload),
           "{\"name\":\"Indoor Humidity\",\"uniq_id\":\"%s_indoor_humidity\","
           "\"stat_t\":\"%s/state/current_humidity\",\"unit_of_meas\":\"%%\","
           "\"dev_cla\":\"humidity\",\"stat_cla\":\"measurement\","
           "\"dev\":{\"ids\":[\"%s\"]}}",
           node.c_str(), base.c_str(), node.c_str());
  g_mqtt.publish(hum_config.c_str(), payload, true);

  // Re-publish announce so /devices reflects the current hostname
  {
    char announce_buf[256];
    snprintf(announce_buf, sizeof(announce_buf),
             "{\"role\":\"display\",\"firmware\":\"%s\",\"name\":\"%s\",\"ip\":\"%s\"}",
             THERMOSTAT_FIRMWARE_VERSION, g_cfg_hostname.c_str(),
             WiFi.localIP().toString().c_str());
    g_mqtt.publish(self_topic_for("announce").c_str(), announce_buf, true);
  }

  g_mqtt_discovery_sent = true;
}

void mqtt_on_message(char *topic, uint8_t *payload, unsigned int length) {
  if (topic == nullptr || payload == nullptr) return;

  xSemaphoreTake(g_api_mutex, portMAX_DELAY);

  char value[128];
  const size_t copy_len = (length < sizeof(value) - 1) ? length : sizeof(value) - 1;
  memcpy(value, payload, copy_len);
  value[copy_len] = '\0';
  if (length >= sizeof(value)) {
    Serial.printf("[mqtt] payload truncated: %u -> %u bytes topic=%s\n",
                  length, static_cast<unsigned>(sizeof(value) - 1), topic);
  }
  char normalized[128];
  memcpy(normalized, value, copy_len + 1);
  lower_in_place(normalized);

  const uint32_t now = millis();
  const String topic_str(topic);

  // Device discovery: parse announce topics from other devices
  // Topic pattern: {base}/devices/{mac}/announce
  {
    const String announce_prefix = g_cfg_base_topic + "/devices/";
    const String announce_suffix = "/announce";
    if (topic_str.startsWith(announce_prefix) && topic_str.endsWith(announce_suffix)) {
      int mac_begin = announce_prefix.length();
      int mac_end = topic_str.length() - announce_suffix.length();
      if (mac_end > mac_begin) {
        String peer_mac = topic_str.substring(mac_begin, mac_end);
        if (peer_mac != g_cfg_device_mac_compact) {
          char buf[256];
          size_t buf_len = (length < sizeof(buf) - 1) ? length : sizeof(buf) - 1;
          memcpy(buf, payload, buf_len);
          buf[buf_len] = '\0';
          char name[48] = "", role[16] = "", ip[16] = "";
          bool ok = ::json_extract_string(buf, "name", name, sizeof(name))
                  && ::json_extract_string(buf, "role", role, sizeof(role))
                  && ::json_extract_string(buf, "ip", ip, sizeof(ip));
          if (ok) {
            char formatted_mac[18];
            format_mac_colons(peer_mac.c_str(), formatted_mac, sizeof(formatted_mac));
            g_device_registry.upsert(formatted_mac, name, role, ip);
          }
        }
      }
      xSemaphoreGive(g_api_mutex);
      return;
    }
  }

  if (g_runtime == nullptr) {
    xSemaphoreGive(g_api_mutex);
    return;
  }
  if (topic_str.startsWith(self_topic_for("cmd/"))) {
    g_last_mqtt_command_ms = now;
  }

