rgregg/esp32-wireless-thermostat/src/thermostat/esp32s3_thermostat_firmware.cpp
  if (topic_str == self_topic_for("cmd/mode")) {
    if (strcmp(normalized, "heat") == 0) {
      g_runtime->on_user_set_mode(FurnaceMode::Heat, now);
    } else if (strcmp(normalized, "cool") == 0) {
      g_runtime->on_user_set_mode(FurnaceMode::Cool, now);
    } else {
      g_runtime->on_user_set_mode(FurnaceMode::Off, now);
    }
  } else if (topic_str == self_topic_for("cmd/fan_mode")) {
    if (strcmp(normalized, "on") == 0 || strcmp(normalized, "always on") == 0) {
      g_runtime->on_user_set_fan_mode(FanMode::AlwaysOn, now);
    } else if (strcmp(normalized, "circulate") == 0) {
      g_runtime->on_user_set_fan_mode(FanMode::Circulate, now);
    } else {
      g_runtime->on_user_set_fan_mode(FanMode::Automatic, now);
    }
  } else if (topic_str == self_topic_for("cmd/target_temp_c")) {
    float celsius = static_cast<float>(atof(value));
    if (std::isfinite(celsius)) {
      if (celsius < 0.0f) celsius = 0.0f;
      if (celsius > 40.0f) celsius = 40.0f;
      g_runtime->on_user_set_setpoint_c(celsius, now);
    }
  } else if (topic_str == self_topic_for("cmd/unit")) {
    g_cfg_temp_unit_f = strcmp(normalized, "f") == 0 || strcmp(normalized, "fahrenheit") == 0;
    g_runtime->set_temperature_unit(g_cfg_temp_unit_f ? TemperatureUnit::Fahrenheit
                                                      : TemperatureUnit::Celsius);
    if (g_cfg_ready) {
      g_cfg.putBool("temp_u_f", g_cfg_temp_unit_f);
    }
  } else if (topic_str == self_topic_for("cmd/sync")) {
    if (parse_bool_payload(normalized)) {
      g_runtime->request_sync(now);
    }
  } else if (topic_str == self_topic_for("cmd/reboot")) {
    if (parse_bool_payload(normalized)) {
      schedule_reboot();
    }
  } else if (topic_str == self_topic_for("cmd/reset_sequence")) {
    if (parse_bool_payload(normalized)) {
      g_runtime->reset_local_command_sequence();
      g_runtime->request_sync(now);
    }
  } else if (topic_str == self_topic_for("cmd/filter_reset")) {
    if (parse_bool_payload(normalized)) {
      g_runtime->request_filter_reset(now);
    }
  } else if (topic_str == self_topic_for("cmd/temp_comp_c")) {
    float comp = static_cast<float>(atof(value));
    if (std::isfinite(comp)) {
      if (comp < -10.0f) comp = -10.0f;
      if (comp > 10.0f) comp = 10.0f;
      g_cfg_temp_comp_c = comp;
      g_runtime->set_local_temperature_compensation_c(g_cfg_temp_comp_c);
      g_last_sensor_poll_ms = 0;  // re-read sensor with new compensation
      if (g_cfg_ready) {
        g_cfg.putFloat("temp_comp", g_cfg_temp_comp_c);
      }
    }
  } else if (topic_str == self_topic_for("cmd/display_timeout_s")) {
    long seconds = atol(value);
    if (seconds < 30) seconds = 30;
    if (seconds > 600) seconds = 600;
    g_display_timeout_ms = static_cast<uint32_t>(seconds) * 1000UL;
    if (g_cfg_ready) {
      g_cfg.putUInt("disp_to_s", static_cast<uint32_t>(seconds));
    }
    g_screen.set_display_timeout_ms(g_display_timeout_ms);
  } else if (topic_str == self_topic_for("cmd/backlight_active_pct")) {
    g_cfg_backlight_active_pct = clamp_percent(atol(value));
    if (g_cfg_ready) {
      g_cfg.putUChar("bl_act", g_cfg_backlight_active_pct);
    }
  } else if (topic_str == self_topic_for("cmd/backlight_screensaver_pct")) {
    g_cfg_backlight_screensaver_pct = clamp_percent(atol(value));
    if (g_cfg_ready) {
      g_cfg.putUChar("bl_dim", g_cfg_backlight_screensaver_pct);
    }
  }

  // Controller state topics (MQTT-primary path)
  if (controller_mac_compact().length() > 0) {
    if (topic_str == controller_topic_for("state/mode")) {
      g_mqtt_ctrl_mode = mqtt_payload::str_to_mode(normalized);
      g_mqtt_ctrl_last_update_ms = now;
    } else if (topic_str == controller_topic_for("state/fan_mode")) {
      g_mqtt_ctrl_fan = mqtt_payload::str_to_fan(normalized);
      g_mqtt_ctrl_last_update_ms = now;
    } else if (topic_str == controller_topic_for("state/target_temp_c")) {
      float sp = static_cast<float>(atof(value));
      if (std::isfinite(sp)) {
        g_mqtt_ctrl_setpoint_c = sp;
        g_mqtt_ctrl_last_update_ms = now;
      }
    } else if (topic_str == controller_topic_for("state/furnace_state")) {
      g_mqtt_ctrl_state = mqtt_payload::str_to_furnace_state(value);
      g_mqtt_ctrl_last_update_ms = now;
    } else if (topic_str == controller_topic_for("state/lockout")) {
      g_mqtt_ctrl_lockout = mqtt_payload::parse_bool(value);
      g_mqtt_ctrl_last_update_ms = now;
    } else if (topic_str == controller_topic_for("state/windows_open")) {
      g_mqtt_ctrl_windows_open = mqtt_payload::parse_bool(value);
      g_mqtt_ctrl_last_update_ms = now;
    } else if (topic_str == controller_topic_for("state/filter_runtime_hours")) {
      float hours = static_cast<float>(atof(value));
      if (std::isfinite(hours) && hours >= 0.0f) {
        g_mqtt_ctrl_filter_runtime_s = static_cast<uint32_t>(hours * 3600.0f);
        g_mqtt_ctrl_last_update_ms = now;
      }
    } else if (topic_str == controller_topic_for("state/outdoor_temp_c")) {
      float temp = static_cast<float>(atof(value));
      if (std::isfinite(temp) && g_runtime != nullptr) {
        g_outdoor_temp_c = temp;
        g_runtime->on_outdoor_weather_update(g_outdoor_temp_c, g_weather_icon);
        g_have_weather_data = true;
      }
    } else if (topic_str == controller_topic_for("state/weather_condition")) {
      WeatherIcon icon = weather_icon_from_api(normalized);
      if (icon == WeatherIcon::Unknown) {
        // Try matching display text for conditions published as English names
        for (uint8_t i = 0; i <= static_cast<uint8_t>(WeatherIcon::Unknown); ++i) {
          const auto candidate = static_cast<WeatherIcon>(i);
          char lower_display[32];
          const char *display = weather_icon_display_text(candidate);
          size_t j = 0;
          for (; display[j] != '\0' && j < sizeof(lower_display) - 1; ++j) {
            lower_display[j] = static_cast<char>(
                std::tolower(static_cast<unsigned char>(display[j])));
          }
          lower_display[j] = '\0';
          if (strcmp(normalized, lower_display) == 0) {
            icon = candidate;
            break;
          }
        }
      }
      if (g_runtime != nullptr) {
        g_weather_icon = icon;
        g_runtime->on_outdoor_weather_update(g_outdoor_temp_c, g_weather_icon);
        g_have_weather_data = true;
      }
    } else if (topic_str == controller_topic_for("state/current_temp_c")) {
      float temp = static_cast<float>(atof(value));
      if (std::isfinite(temp)) {
        g_remote_indoor_temp_c = temp;
      }
    } else if (topic_str == controller_topic_for("state/current_humidity")) {
      float hum = static_cast<float>(atof(value));
      if (std::isfinite(hum)) {
        g_remote_indoor_humidity = hum;
      }
    } else if (topic_str == controller_topic_for("state/availability")) {
      g_mqtt_ctrl_available = strcmp(normalized, "online") == 0;
    }
  }

  mqtt_publish_state();
  xSemaphoreGive(g_api_mutex);
}

void wifi_event_handler(arduino_event_t *event) {
  if (event == nullptr) return;
  if (event->event_id == ARDUINO_EVENT_WIFI_STA_GOT_IP) {
    g_wifi.on_wifi_connected();
  }
}

void ensure_wifi_connected(uint32_t now_ms) {
  g_wifi.ensure_connected(now_ms);
}

