rgregg/esp32-wireless-thermostat/src/thermostat/esp32s3_thermostat_firmware.cpp
void ensure_mqtt_connected(uint32_t now_ms) {
  if (g_cfg_mqtt_host.length() == 0 || !g_cfg_mqtt_enabled) return;
  if (WiFi.status() != WL_CONNECTED) return;
  if (g_cfg_mqtt_reconfigure_required) {
    g_cfg_mqtt_reconfigure_required = false;
    g_mqtt_discovery_sent = false;
    g_mqtt.disconnect();
  }
  if (g_mqtt.connected()) return;
  if ((now_ms - g_last_mqtt_attempt_ms) < kNetworkRetryMs) return;

  g_last_mqtt_attempt_ms = now_ms;
  g_mqtt.setServer(g_cfg_mqtt_host.c_str(), g_cfg_mqtt_port);

  bool ok = false;
  String will_topic = self_topic_for("state/availability");
  if (g_cfg_mqtt_user.length() == 0) {
    ok = g_mqtt.connect(g_cfg_mqtt_client_id.c_str(),
                        will_topic.c_str(), 1, true, "offline");
  } else {
    ok = g_mqtt.connect(g_cfg_mqtt_client_id.c_str(),
                        g_cfg_mqtt_user.c_str(), g_cfg_mqtt_password.c_str(),
                        will_topic.c_str(), 1, true, "offline");
  }

  if (!ok) {
    g_last_mqtt_error = String("connect_state_") + String(g_mqtt.state());
    return;
  }
  g_last_mqtt_error = "none";

  g_mqtt.subscribe(self_topic_for("cmd/mode").c_str());
  g_mqtt.subscribe(self_topic_for("cmd/fan_mode").c_str());
  g_mqtt.subscribe(self_topic_for("cmd/target_temp_c").c_str());
  g_mqtt.subscribe(self_topic_for("cmd/unit").c_str());
  g_mqtt.subscribe(self_topic_for("cmd/sync").c_str());
  g_mqtt.subscribe(self_topic_for("cmd/reboot").c_str());
  g_mqtt.subscribe(self_topic_for("cmd/reset_sequence").c_str());
  g_mqtt.subscribe(self_topic_for("cmd/filter_reset").c_str());
  g_mqtt.subscribe(self_topic_for("cmd/temp_comp_c").c_str());
  g_mqtt.subscribe(self_topic_for("cmd/display_timeout_s").c_str());
  g_mqtt.subscribe(self_topic_for("cmd/backlight_active_pct").c_str());
  g_mqtt.subscribe(self_topic_for("cmd/backlight_screensaver_pct").c_str());

  if (controller_mac_compact().length() > 0) {
    g_mqtt.subscribe(controller_topic_for("state/mode").c_str());
    g_mqtt.subscribe(controller_topic_for("state/fan_mode").c_str());
    g_mqtt.subscribe(controller_topic_for("state/target_temp_c").c_str());
    g_mqtt.subscribe(controller_topic_for("state/furnace_state").c_str());
    g_mqtt.subscribe(controller_topic_for("state/lockout").c_str());
    g_mqtt.subscribe(controller_topic_for("state/windows_open").c_str());
    g_mqtt.subscribe(controller_topic_for("state/filter_runtime_hours").c_str());
    g_mqtt.subscribe(controller_topic_for("state/outdoor_temp_c").c_str());
    g_mqtt.subscribe(controller_topic_for("state/weather_condition").c_str());
    g_mqtt.subscribe(controller_topic_for("state/availability").c_str());
    g_mqtt.subscribe(controller_topic_for("state/current_temp_c").c_str());
    g_mqtt.subscribe(controller_topic_for("state/current_humidity").c_str());
  }

  // Subscribe to device announce topics for discovery
  g_mqtt.subscribe(device_topic_for("+", "announce").c_str());

  if (g_cfg_ha_discovery_enabled) {
    mqtt_publish_discovery();
  }
  mqtt_publish_state();

  // Publish our announce message so other devices can discover us
  {
    char announce_buf[256];
    snprintf(announce_buf, sizeof(announce_buf),
             "{\"role\":\"display\",\"firmware\":\"%s\",\"name\":\"%s\",\"ip\":\"%s\"}",
             THERMOSTAT_FIRMWARE_VERSION, g_cfg_hostname.c_str(),
             WiFi.localIP().toString().c_str());
    g_mqtt.publish(self_topic_for("announce").c_str(), announce_buf, true);
  }
}

void ensure_mdns_ready() {
  if (WiFi.status() != WL_CONNECTED || g_mdns_started) return;
  const char *host =
      g_cfg_hostname.length() > 0 ? g_cfg_hostname.c_str() : "furnace-display";
  if (MDNS.begin(host)) {
    MDNS.addService("http", "tcp", 80);
    g_mdns_started = true;
  }
}

void rgb_flush_cb(lv_disp_drv_t *disp_drv, const lv_area_t *area, lv_color_t *color_p) {
  if (g_panel == nullptr || g_flush_ready_sem == nullptr) {
    lv_disp_flush_ready(disp_drv);
    return;
  }
  // Drain any stale VSYNC signals so the take below waits for the
  // VSYNC that happens *after* draw_bitmap queues the buffer swap.
  xSemaphoreTake(g_flush_ready_sem, 0);

  esp_lcd_rgb_panel_restart(g_panel);
  esp_lcd_panel_draw_bitmap(g_panel, 0, 0, kDisplayWidth, kDisplayHeight, color_p);

  // Wait for the buffer swap to actually complete at VSYNC before
  // letting LVGL draw into the next buffer.
  xSemaphoreTake(g_flush_ready_sem, pdMS_TO_TICKS(100));
  lv_disp_flush_ready(disp_drv);
}

bool gt911_read(uint16_t reg, uint8_t *buf, size_t len) {
  g_touch_i2c.beginTransmission(kGt911Addr);
  g_touch_i2c.write(static_cast<uint8_t>((reg >> 8) & 0xFF));
  g_touch_i2c.write(static_cast<uint8_t>(reg & 0xFF));
  if (g_touch_i2c.endTransmission(false) != 0) {
    return false;
  }

  const size_t read =
      g_touch_i2c.requestFrom(static_cast<int>(kGt911Addr), static_cast<int>(len));
  if (read != len) {
    return false;
  }

  for (size_t i = 0; i < len; ++i) {
    buf[i] = g_touch_i2c.read();
  }
  return true;
}

bool gt911_write(uint16_t reg, uint8_t val) {
  g_touch_i2c.beginTransmission(kGt911Addr);
  g_touch_i2c.write(static_cast<uint8_t>((reg >> 8) & 0xFF));
  g_touch_i2c.write(static_cast<uint8_t>(reg & 0xFF));
  g_touch_i2c.write(val);
  return g_touch_i2c.endTransmission() == 0;
}

void show_page(ThermostatPage page);
void apply_backlight(bool screensaver_active);

void poll_touch() {
  if (!g_sensors_initialized) { g_touch.touched = false; return; }
  uint8_t status = 0;
  if (!gt911_read(0x814E, &status, 1)) {
    g_touch.touched = false;
    return;
  }

  const uint8_t points = status & 0x0F;
  if ((status & 0x80) == 0 || points == 0) {
    g_touch.touched = false;
    gt911_write(0x814E, 0);
    return;
  }

  uint8_t data[8] = {0};
  if (!gt911_read(0x8150, data, sizeof(data))) {
    g_touch.touched = false;
    return;
  }

  const uint16_t raw_x = static_cast<uint16_t>(data[1] << 8 | data[0]);
  const uint16_t raw_y = static_cast<uint16_t>(data[3] << 8 | data[2]);

  // Scale touch coordinates to display resolution if GT911 config differs
  const int16_t x = (g_touch_x_max > 0 && g_touch_x_max != kDisplayWidth)
                        ? static_cast<int16_t>(static_cast<uint32_t>(raw_x) * kDisplayWidth / g_touch_x_max)
                        : static_cast<int16_t>(raw_x);
  const int16_t y = (g_touch_y_max > 0 && g_touch_y_max != kDisplayHeight)
                        ? static_cast<int16_t>(static_cast<uint32_t>(raw_y) * kDisplayHeight / g_touch_y_max)
                        : static_cast<int16_t>(raw_y);

  g_touch.touched = true;
  g_touch.x = x;
  g_touch.y = y;

  gt911_write(0x814E, 0);
}

void touch_read_cb(lv_indev_drv_t *, lv_indev_data_t *data) {
  poll_touch();
  if (g_touch.touched) {
    data->state = LV_INDEV_STATE_PRESSED;
    data->point.x = g_touch.x;
    data->point.y = g_touch.y;
    const bool was_screensaver = g_screen.screensaver_active();
    g_screen.on_user_interaction(millis());
    if (was_screensaver && !g_screen.screensaver_active()) {
      show_page(g_screen.current_page());
      apply_backlight(false);
    }
  } else {
    data->state = LV_INDEV_STATE_RELEASED;
  }
}

