rgregg/esp32-wireless-thermostat/src/thermostat/esp32s3_thermostat_firmware.cpp
void show_page(ThermostatPage page) {
  if (g_home_page == nullptr) return;

  lv_obj_add_flag(g_home_page, LV_OBJ_FLAG_HIDDEN);
  lv_obj_add_flag(g_fan_page, LV_OBJ_FLAG_HIDDEN);
  lv_obj_add_flag(g_mode_page, LV_OBJ_FLAG_HIDDEN);
  lv_obj_add_flag(g_settings_page, LV_OBJ_FLAG_HIDDEN);
  lv_obj_add_flag(g_screensaver_page, LV_OBJ_FLAG_HIDDEN);

  switch (page) {
    case ThermostatPage::Home:
      lv_obj_clear_flag(g_home_page, LV_OBJ_FLAG_HIDDEN);
      break;
    case ThermostatPage::Fan:
      lv_obj_clear_flag(g_fan_page, LV_OBJ_FLAG_HIDDEN);
      break;
    case ThermostatPage::Mode:
      lv_obj_clear_flag(g_mode_page, LV_OBJ_FLAG_HIDDEN);
      break;
    case ThermostatPage::Settings:
      lv_obj_clear_flag(g_settings_page, LV_OBJ_FLAG_HIDDEN);
      break;
    case ThermostatPage::Screensaver:
      lv_obj_clear_flag(g_screensaver_page, LV_OBJ_FLAG_HIDDEN);
      break;
  }

  if (g_tabs != nullptr) {
    if (page == ThermostatPage::Screensaver) {
      lv_obj_add_flag(g_tabs, LV_OBJ_FLAG_HIDDEN);
    } else {
      lv_obj_clear_flag(g_tabs, LV_OBJ_FLAG_HIDDEN);
    }
  }
}

void apply_backlight(bool screensaver_active) {
  if (!g_backlight_enabled) {
    ledcWrite(kBacklightPin, 0);
    return;
  }
  const uint8_t duty =
      screensaver_active ? percent_to_duty(g_cfg_backlight_screensaver_pct)
                         : percent_to_duty(g_cfg_backlight_active_pct);
  ledcWrite(kBacklightPin, duty);
}

void refresh_ui() {
  if (g_runtime == nullptr || !g_ui_ready) return;

  const uint32_t now = millis();

  if (g_status_label != nullptr) lv_label_set_text(g_status_label, g_runtime->status_text(now).c_str());
  if (g_indoor_label != nullptr) lv_label_set_text(g_indoor_label, g_runtime->indoor_temp_text().c_str());
  if (g_humidity_label != nullptr) lv_label_set_text(g_humidity_label, g_runtime->indoor_humidity_text().c_str());
  if (g_setpoint_label != nullptr) lv_label_set_text(g_setpoint_label, g_runtime->setpoint_text().c_str());
  // Show/hide outdoor section based on weather data availability
  if (g_outdoor_section != nullptr) {
    if (g_have_weather_data) {
      lv_obj_clear_flag(g_outdoor_section, LV_OBJ_FLAG_HIDDEN);
      lv_label_set_text(g_weather_label, g_runtime->weather_text().c_str());
      if (g_weather_icon_label != nullptr) {
        lv_label_set_text(g_weather_icon_label,
                          thermostat::ui::weather_icon_symbol(g_runtime->weather_icon()));
      }
    } else {
      lv_obj_add_flag(g_outdoor_section, LV_OBJ_FLAG_HIDDEN);
    }
  }

  if (g_home_time_label != nullptr) {
    lv_label_set_text(g_home_time_label, current_time_text().c_str());
  }
  if (g_home_date_label != nullptr) {
    lv_label_set_text(g_home_date_label, current_date_text().c_str());
  }
  lv_label_set_text(g_screen_time_label, current_time_text().c_str());
  if (g_screen_weather_label != nullptr) {
    lv_label_set_text(g_screen_weather_label, g_have_weather_data ? g_runtime->weather_text().c_str() : "");
  }
  if (g_screen_indoor_label != nullptr) {
    lv_label_set_text(g_screen_indoor_label, g_runtime->indoor_temp_text().c_str());
  }
  if (g_screen_status_label != nullptr) {
    lv_label_set_text(g_screen_status_label, g_runtime->status_text(now).c_str());
  }
  if (g_screen.screensaver_active()) {
    thermostat::ui::update_screensaver_layout(g_screen_time_label, g_screen_weather_label,
                                              g_screen_indoor_label, g_screen_status_label,
                                              now / 60000UL);
  }
  const bool wifi_connected = WiFi.status() == WL_CONNECTED;
  const bool mqtt_connected = g_mqtt.connected();
  const uint32_t uptime_s = now / 1000UL;
  const uint32_t last_mqtt_ms = g_last_mqtt_command_ms;
  const uint32_t last_ctrl_hb_ms = g_runtime->last_controller_heartbeat_ms();
  const uint32_t since_mqtt_ms = last_mqtt_ms > 0 ? (now - last_mqtt_ms) : 0;
  const uint32_t since_ctrl_ms = last_ctrl_hb_ms > 0 ? (now - last_ctrl_hb_ms) : 0;

  static char system_text[256];
  snprintf(system_text, sizeof(system_text),
    "fw: %s\nboot_count: %lu\nreset: %s\nuptime_s: %lu\nfree_heap_b: %lu",
    THERMOSTAT_FIRMWARE_VERSION,
    (unsigned long)g_boot_count,
    g_reset_reason.c_str(),
    (unsigned long)uptime_s,
    (unsigned long)esp_get_free_heap_size());

  static char wifi_text[256];
  {
    char ip_buf[20] = "N/A";
    char ssid_buf[64] = "N/A";
    if (wifi_connected) {
      snprintf(ip_buf, sizeof(ip_buf), "%s", WiFi.localIP().toString().c_str());
      snprintf(ssid_buf, sizeof(ssid_buf), "%s", WiFi.SSID().c_str());
    }
    snprintf(wifi_text, sizeof(wifi_text),
      "connected: %s\nip: %s\nssid: %s\nmac: %s\nchannel: %d\nrssi_dbm: %d",
      wifi_connected ? "yes" : "no",
      ip_buf, ssid_buf,
      WiFi.macAddress().c_str(),
      wifi_connected ? WiFi.channel() : 0,
      wifi_connected ? (int)WiFi.RSSI() : 0);
  }

  static char mqtt_text[300];
  snprintf(mqtt_text, sizeof(mqtt_text),
    "connected: %s\nstate: %d\nhost: %s:%u\nclient_id: %s\nbase_topic: %s\nuser: %s\npassword: %s\nlast_cmd_ms: %lu\nsince_cmd_ms: %lu",
    mqtt_connected ? "yes" : "no",
    g_mqtt.state(),
    g_cfg_mqtt_host.c_str(),
    (unsigned)g_cfg_mqtt_port,
    g_cfg_mqtt_client_id.c_str(),
    g_cfg_base_topic.c_str(),
    g_cfg_mqtt_user.length() > 0 ? g_cfg_mqtt_user.c_str() : "(none)",
    g_cfg_mqtt_password.length() > 0 ? "set" : "unset",
    (unsigned long)last_mqtt_ms,
    (unsigned long)since_mqtt_ms);

  static char controller_text[128];
  snprintf(controller_text, sizeof(controller_text),
    "last_hb_ms: %lu\nsince_hb_ms: %lu",
    (unsigned long)last_ctrl_hb_ms,
    (unsigned long)since_ctrl_ms);

  static char espnow_text[180];
  snprintf(espnow_text, sizeof(espnow_text),
    "channel: %u\npeer_mac: %s\ntx_ok: %lu\ntx_fail: %lu",
    (unsigned)g_cfg_espnow_channel,
    g_cfg_espnow_peer_mac.c_str(),
    (unsigned long)g_runtime->espnow_send_ok_count(),
    (unsigned long)g_runtime->espnow_send_fail_count());

  static char config_text[220];
  snprintf(config_text, sizeof(config_text),
    "temp_unit: %s\ntemp_comp_c: %.2f\ndisplay_timeout_s: %lu\nbrightness_pct: %u\nsaver_pct: %u\nreboot_required: %s\nreboot_pending: %s",
    g_cfg_temp_unit_f ? "F" : "C",
    (double)g_cfg_temp_comp_c,
    (unsigned long)(g_display_timeout_ms / 1000UL),
    (unsigned)g_cfg_backlight_active_pct,
    (unsigned)g_cfg_backlight_screensaver_pct,
    g_cfg_reboot_required ? "true" : "false",
    g_reboot_requested ? "true" : "false");

