rgregg/esp32-wireless-thermostat/src/thermostat/esp32s3_thermostat_firmware.cpp
  static char errors_text[160];
  snprintf(errors_text, sizeof(errors_text),
    "mqtt: %s\nota: %s\nespnow: %s\nsensor_fails: %u",
    g_last_mqtt_error.c_str(),
    g_last_ota_error.c_str(),
    g_last_espnow_error.c_str(),
    (unsigned)g_sensor_fail_count);

  if (g_settings_system_label != nullptr) lv_label_set_text(g_settings_system_label, system_text);
  if (g_settings_wifi_label != nullptr) lv_label_set_text(g_settings_wifi_label, wifi_text);
  if (g_settings_mqtt_label != nullptr) lv_label_set_text(g_settings_mqtt_label, mqtt_text);
  if (g_settings_controller_label != nullptr) {
    lv_label_set_text(g_settings_controller_label, controller_text);
  }
  if (g_settings_espnow_label != nullptr) lv_label_set_text(g_settings_espnow_label, espnow_text);
  if (g_settings_config_label != nullptr) lv_label_set_text(g_settings_config_label, config_text);
  if (g_settings_errors_label != nullptr) lv_label_set_text(g_settings_errors_label, errors_text);
  if (g_settings_display_label != nullptr) lv_label_set_text(g_settings_display_label, system_text);
  if (g_settings_diag_label != nullptr) lv_label_set_text(g_settings_diag_label, errors_text);
  if (g_timeout_slider != nullptr && !lv_obj_has_state(g_timeout_slider, LV_STATE_PRESSED)) {
    lv_slider_set_value(g_timeout_slider, static_cast<int32_t>(g_display_timeout_ms / 1000UL),
                        LV_ANIM_OFF);
  }
  if (g_brightness_slider != nullptr && !lv_obj_has_state(g_brightness_slider, LV_STATE_PRESSED)) {
    lv_slider_set_value(g_brightness_slider, static_cast<int32_t>(g_cfg_backlight_active_pct),
                        LV_ANIM_OFF);
  }
  if (g_dim_slider != nullptr && !lv_obj_has_state(g_dim_slider, LV_STATE_PRESSED)) {
    lv_slider_set_value(g_dim_slider, static_cast<int32_t>(g_cfg_backlight_screensaver_pct),
                        LV_ANIM_OFF);
  }

  // Controller connectivity check
  const uint32_t mqtt_cmd_ms = g_last_mqtt_command_ms;
  const uint32_t mqtt_ctrl_ms = g_mqtt_ctrl_last_update_ms;
  const uint32_t espnow_ms = g_runtime->last_controller_heartbeat_ms();
  const bool controller_connected =
      (mqtt_cmd_ms > 0 && (now - mqtt_cmd_ms) < g_cfg_controller_timeout_ms) ||
      (mqtt_ctrl_ms > 0 && (now - mqtt_ctrl_ms) < g_cfg_controller_timeout_ms) ||
      (espnow_ms > 0 && (now - espnow_ms) < g_cfg_controller_timeout_ms);

  thermostat::ui::set_mode_button_state(g_runtime->local_mode());
  thermostat::ui::set_fan_button_state(g_runtime->local_fan_mode());
  thermostat::ui::set_temperature_unit_button_state(g_runtime->temperature_unit());
  g_screen.on_mode_changed(g_runtime->local_mode());
  if (g_setpoint_column != nullptr) {
    if (controller_connected && g_screen.setpoint_visible()) {
      lv_obj_clear_flag(g_setpoint_column, LV_OBJ_FLAG_HIDDEN);
    } else {
      lv_obj_add_flag(g_setpoint_column, LV_OBJ_FLAG_HIDDEN);
    }
  }
  if (g_filter_label != nullptr) {
    if (g_runtime->filter_runtime_hours() >= kFilterChangeThresholdHours) {
      lv_label_set_text(g_filter_label, "Change Filter");
      lv_obj_clear_flag(g_filter_label, LV_OBJ_FLAG_HIDDEN);
    } else {
      lv_obj_add_flag(g_filter_label, LV_OBJ_FLAG_HIDDEN);
    }
  }

  // Fan page status + button state
  if (g_fan_status_label != nullptr) {
    if (!controller_connected) {
      lv_label_set_text(g_fan_status_label, "Not Connected");
    } else {
      const FurnaceStateCode cs = g_runtime->controller_state();
      const char *fan_text = (cs == FurnaceStateCode::HeatOn || cs == FurnaceStateCode::CoolOn ||
                              cs == FurnaceStateCode::FanOn)
                                 ? "Fan Running"
                                 : "Idle";
      lv_label_set_text(g_fan_status_label, fan_text);
    }
  }
  thermostat::ui::set_fan_mode_buttons_enabled(controller_connected);

  // Mode page status + button state
  if (g_mode_status_label != nullptr) {
    if (!controller_connected) {
      lv_label_set_text(g_mode_status_label, "Not Connected");
    } else {
      lv_label_set_text(g_mode_status_label, g_runtime->status_text(now).c_str());
    }
  }
  thermostat::ui::set_mode_buttons_enabled(controller_connected);
}

void tab_event_cb(lv_event_t *) {
  if (g_runtime == nullptr) return;
  const char *txt = lv_btnmatrix_get_btn_text(g_tabs, lv_btnmatrix_get_selected_btn(g_tabs));
  const uint32_t now = millis();
  if (strcmp(txt, "HOME") == 0) {
    g_screen.on_tab_selected(ThermostatPage::Home, now);
  } else if (strcmp(txt, "FAN") == 0) {
    g_screen.on_tab_selected(ThermostatPage::Fan, now);
  } else if (strcmp(txt, "MODE") == 0) {
    g_screen.on_tab_selected(ThermostatPage::Mode, now);
  } else if (strcmp(txt, "SETTINGS") == 0) {
    g_screen.on_tab_selected(ThermostatPage::Settings, now);
  }
  show_page(g_screen.current_page());
}

void btn_setpoint_up_cb(lv_event_t *) {
  if (g_runtime == nullptr) return;
  const float step = (g_runtime->temperature_unit() == TemperatureUnit::Fahrenheit) ? 1.0f : 0.5f;
  const float user_val = g_runtime->temperature_unit() == TemperatureUnit::Fahrenheit
                             ? ((g_runtime->local_setpoint_c() * 9.0f / 5.0f) + 32.0f)
                             : g_runtime->local_setpoint_c();
  g_runtime->on_user_set_setpoint(user_val + step, millis());
}

void btn_setpoint_down_cb(lv_event_t *) {
  if (g_runtime == nullptr) return;
  const float step = (g_runtime->temperature_unit() == TemperatureUnit::Fahrenheit) ? 1.0f : 0.5f;
  const float user_val = g_runtime->temperature_unit() == TemperatureUnit::Fahrenheit
                             ? ((g_runtime->local_setpoint_c() * 9.0f / 5.0f) + 32.0f)
                             : g_runtime->local_setpoint_c();
  g_runtime->on_user_set_setpoint(user_val - step, millis());
}

void btn_mode_cb(lv_event_t *e) {
  if (g_runtime == nullptr) return;
  auto mode = static_cast<FurnaceMode>(reinterpret_cast<uintptr_t>(lv_event_get_user_data(e)));
  g_runtime->on_user_set_mode(mode, millis());
}

void btn_fan_cb(lv_event_t *e) {
  if (g_runtime == nullptr) return;
  auto mode = static_cast<FanMode>(reinterpret_cast<uintptr_t>(lv_event_get_user_data(e)));
  g_runtime->on_user_set_fan_mode(mode, millis());
}

void btn_unit_cb(lv_event_t *e) {
  auto unit = static_cast<TemperatureUnit>(reinterpret_cast<uintptr_t>(lv_event_get_user_data(e)));
  const char *raw = (unit == TemperatureUnit::Fahrenheit) ? "f" : "c";
  try_update_runtime_config("temperature_unit", raw);
  mqtt_publish_state();
}

void btn_sync_cb(lv_event_t *) {
  if (g_runtime == nullptr) return;
  g_runtime->request_sync(millis());
}

void btn_filter_reset_cb(lv_event_t *) {
  if (g_runtime == nullptr) return;
  g_runtime->request_filter_reset(millis());
}

void apply_runtime_u32_setting(const char *key, uint32_t value) {
  String raw(value);
  if (try_update_runtime_config(key, raw.c_str())) {
    mqtt_publish_state();
  }
}

