rgregg/esp32-wireless-thermostat/src/thermostat/esp32s3_thermostat_firmware.cpp
uint32_t snap_to_step(uint32_t value, uint32_t step, uint32_t min_v, uint32_t max_v) {
  if (value < min_v) value = min_v;
  if (value > max_v) value = max_v;
  const uint32_t snapped = ((value + (step / 2U)) / step) * step;
  if (snapped < min_v) return min_v;
  if (snapped > max_v) return max_v;
  return snapped;
}

void timeout_slider_cb(lv_event_t *e) {
  lv_obj_t *slider = lv_event_get_target(e);
  if (slider == nullptr) return;
  uint32_t seconds = static_cast<uint32_t>(lv_slider_get_value(slider));
  seconds = snap_to_step(seconds, 30U, 30U, 600U);
  lv_slider_set_value(slider, static_cast<int32_t>(seconds), LV_ANIM_OFF);
  apply_runtime_u32_setting("display_timeout_s", seconds);
}

void brightness_slider_cb(lv_event_t *e) {
  lv_obj_t *slider = lv_event_get_target(e);
  if (slider == nullptr) return;
  uint32_t percent = static_cast<uint32_t>(lv_slider_get_value(slider));
  percent = snap_to_step(percent, 5U, 0U, 100U);
  lv_slider_set_value(slider, static_cast<int32_t>(percent), LV_ANIM_OFF);
  apply_runtime_u32_setting("backlight_active_pct", percent);
}

void dim_slider_cb(lv_event_t *e) {
  lv_obj_t *slider = lv_event_get_target(e);
  if (slider == nullptr) return;
  uint32_t percent = static_cast<uint32_t>(lv_slider_get_value(slider));
  percent = snap_to_step(percent, 5U, 0U, 100U);
  lv_slider_set_value(slider, static_cast<int32_t>(percent), LV_ANIM_OFF);
  apply_runtime_u32_setting("backlight_screensaver_pct", percent);
}

void create_ui() {
  thermostat::ui::UiCallbacks callbacks{};
  callbacks.on_tab_changed = tab_event_cb;
  callbacks.on_setpoint_up = btn_setpoint_up_cb;
  callbacks.on_setpoint_down = btn_setpoint_down_cb;
  callbacks.on_mode = btn_mode_cb;
  callbacks.on_fan = btn_fan_cb;
  callbacks.on_unit = btn_unit_cb;
  callbacks.on_sync = btn_sync_cb;
  callbacks.on_filter_reset = btn_filter_reset_cb;
  callbacks.on_wifi_reset = [](lv_event_t *) {
    Serial.println("[ui] WiFi reset requested — clearing credentials and rebooting");
    g_wifi.clear_credentials();
    schedule_reboot();
  };
  callbacks.on_restart = [](lv_event_t *) {
    Serial.println("[ui] Restart requested");
    schedule_reboot();
  };
  callbacks.on_timeout_slider = timeout_slider_cb;
  callbacks.on_brightness_slider = brightness_slider_cb;
  callbacks.on_dim_slider = dim_slider_cb;

  thermostat::ui::UiHandles handles{};
  thermostat::ui::build_thermostat_ui(callbacks, &handles);

  g_tabs = handles.tabs;
  g_home_page = handles.home_page;
  g_fan_page = handles.fan_page;
  g_mode_page = handles.mode_page;
  g_settings_page = handles.settings_page;
  g_screensaver_page = handles.screensaver_page;
  g_status_label = handles.status_label;
  g_indoor_label = handles.indoor_label;
  g_humidity_label = handles.humidity_label;
  g_setpoint_label = handles.setpoint_label;
  g_outdoor_section = handles.outdoor_section;
  g_weather_label = handles.weather_label;
  g_weather_icon_label = handles.weather_icon_label;
  g_home_time_label = handles.home_time_label;
  g_home_date_label = handles.home_date_label;
  g_screen_time_label = handles.screen_time_label;
  g_screen_weather_label = handles.screen_weather_label;
  g_screen_indoor_label = handles.screen_indoor_label;
  g_screen_status_label = handles.screen_status_label;
  g_settings_diag_label = handles.settings_diag_label;
  g_settings_display_label = handles.settings_display_label;
  g_settings_system_label = handles.settings_system_label;
  g_settings_wifi_label = handles.settings_wifi_label;
  g_settings_mqtt_label = handles.settings_mqtt_label;
  g_settings_controller_label = handles.settings_controller_label;
  g_settings_espnow_label = handles.settings_espnow_label;
  g_settings_config_label = handles.settings_config_label;
  g_settings_errors_label = handles.settings_errors_label;
  g_timeout_slider = handles.timeout_slider;
  g_brightness_slider = handles.brightness_slider;
  g_dim_slider = handles.dim_slider;
  g_setpoint_column = handles.setpoint_column;
  g_filter_label = handles.filter_label;
  g_fan_status_label = handles.fan_status_label;
  g_mode_status_label = handles.mode_status_label;

  show_page(ThermostatPage::Home);
  g_ui_ready = true;
}

bool init_display_and_lvgl() {
  esp_lcd_rgb_panel_config_t panel_config = {};
  panel_config.clk_src = LCD_CLK_SRC_DEFAULT;
  panel_config.timings.pclk_hz = 14000000;
  panel_config.timings.h_res = kDisplayWidth;
  panel_config.timings.v_res = kDisplayHeight;
  panel_config.timings.hsync_back_porch = 8;
  panel_config.timings.hsync_front_porch = 8;
  panel_config.timings.hsync_pulse_width = 4;
  panel_config.timings.vsync_back_porch = 8;
  panel_config.timings.vsync_front_porch = 8;
  panel_config.timings.vsync_pulse_width = 4;
  panel_config.timings.flags.pclk_active_neg = 1;

  panel_config.data_width = 16;
  panel_config.de_gpio_num = 40;
  panel_config.pclk_gpio_num = 42;
  panel_config.vsync_gpio_num = 41;
  panel_config.hsync_gpio_num = 39;
  panel_config.disp_gpio_num = -1;

  // Pin order: R0-R4, G0-G5, B0-B4 (panel uses BGR element order)
  int pins[16] = {8, 3, 46, 9, 1, 5, 6, 7, 15, 16, 4, 45, 48, 47, 21, 14};
  for (size_t i = 0; i < 16; ++i) {
    panel_config.data_gpio_nums[i] = pins[i];
  }

  panel_config.flags.fb_in_psram = 1;
  // Bounce buffer is internal DMA-capable RAM (stages PSRAM framebuffer lines). 4
  // lines (~12.8 KB across the two ping-pong buffers) instead of 10 (~32 KB) keeps the
  // *contiguous* internal block modest — plenty for a low-refresh thermostat UI. (The
  // old NimBLE provisioning could fragment this region; provisioning is now SoftAP, but
  // the smaller buffer is kept as cheap headroom.)
  panel_config.bounce_buffer_size_px = 4 * kDisplayWidth;
  panel_config.num_fbs = 2;

  lv_init();

  delay(kDisplayInitSettleMs);
  if (esp_lcd_new_rgb_panel(&panel_config, &g_panel) != ESP_OK) {
    // Most common cause: not enough *contiguous* internal DMA RAM for the bounce
    // buffer (e.g. NimBLE fragmented it during provisioning boot). Don't register
    // an LVGL display with null buffers — that derefs a null default display and
    // panics. Run headless instead so the rest of the firmware stays up.
    Serial.println("[display] FATAL: esp_lcd_new_rgb_panel failed — running headless");
    g_panel = nullptr;
    g_display_ready = false;
    return false;
  }

  esp_lcd_panel_reset(g_panel);
  esp_lcd_panel_init(g_panel);

