rgregg/esp32-wireless-thermostat/src/thermostat/esp32s3_thermostat_firmware.cpp
  // Register VSYNC callback so the flush can wait for the buffer swap
  g_flush_ready_sem = xSemaphoreCreateBinary();
  if (!g_flush_ready_sem) {
    Serial.println("[display] FATAL: failed to create VSYNC semaphore — running headless");
    // Release the panel's PSRAM framebuffers + contiguous internal bounce buffers
    // and null g_panel so the post-condition holds: g_display_ready == false implies
    // g_panel == nullptr. The reboot/OTA teardown paths gate on g_panel != nullptr,
    // so leaving a half-wired panel here would let them poke uninitialized hardware.
    esp_lcd_panel_del(g_panel);
    g_panel = nullptr;
    g_display_ready = false;
    return false;
  }
  esp_lcd_rgb_panel_event_callbacks_t cbs = {};
  cbs.on_vsync = on_vsync_ready;
  esp_lcd_rgb_panel_register_event_callbacks(g_panel, &cbs, nullptr);

  // Get the panel's two PSRAM framebuffers for double-buffered direct mode.
  // LVGL draws dirty areas into one buffer while the panel DMA reads the other.
  // On flush, esp_lcd_panel_draw_bitmap detects the source is a panel buffer
  // and does an atomic pointer swap instead of a copy.
  void *panel_fb0 = nullptr;
  void *panel_fb1 = nullptr;
  esp_lcd_rgb_panel_get_frame_buffer(g_panel, 2, &panel_fb0, &panel_fb1);

  const size_t buf_pixels = kDisplayWidth * kDisplayHeight;
  g_buf_1 = static_cast<lv_color_t *>(panel_fb0);
  g_buf_2 = static_cast<lv_color_t *>(panel_fb1);

  lv_disp_draw_buf_init(&g_draw_buf, g_buf_1, g_buf_2, buf_pixels);
  lv_disp_drv_init(&g_disp_drv);
  g_disp_drv.hor_res = kDisplayWidth;
  g_disp_drv.ver_res = kDisplayHeight;
  g_disp_drv.flush_cb = rgb_flush_cb;
  g_disp_drv.draw_buf = &g_draw_buf;
  g_disp_drv.direct_mode = 1;
  g_disp_drv.full_refresh = 1;
  lv_disp_drv_register(&g_disp_drv);

  // Touch input is only meaningful with a live display.
  lv_indev_drv_init(&g_indev_drv);
  g_indev_drv.type = LV_INDEV_TYPE_POINTER;
  g_indev_drv.read_cb = touch_read_cb;
  lv_indev_drv_register(&g_indev_drv);

  g_display_ready = true;
  return true;
}

void init_backlight() {
  ledcAttach(kBacklightPin, kBacklightFreq, kBacklightResolution);
  ledcWrite(kBacklightPin, 0);
  g_backlight_enabled = false;
  g_backlight_enable_at_ms = 0;
}

void init_sensors() {
  g_touch_i2c.begin(kTouchI2cSda, kTouchI2cScl, 400000U);
  g_sensor_i2c.begin(kSensorI2cSda, kSensorI2cScl, 100000U);

  // Try AHT20 first (I2C addr 0x38)
  if (g_aht.begin(&g_sensor_i2c)) {
    // Validate with a test read — ghost devices return 0.0/0.0
    sensors_event_t h, t;
    if (g_aht.getEvent(&h, &t) &&
        !(t.temperature == 0.0f && h.relative_humidity == 0.0f)) {
      g_sensor_type = SensorType::AHT;
      Serial.println("[sensor] AHT detected");
    }
  }
  // Try Si7021 if AHT not found (I2C addr 0x40)
  if (g_sensor_type == SensorType::None && g_si7021.begin()) {
    g_sensor_type = SensorType::Si7021;
    Serial.println("[sensor] Si7021 detected");
  }
  if (g_sensor_type == SensorType::None) {
    Serial.println("[sensor] no sensor detected");
  }

  // Read GT911 configured resolution for coordinate scaling
  uint8_t res[4] = {0};
  if (gt911_read(0x8048, res, 4)) {
    const uint16_t x_max = static_cast<uint16_t>(res[1] << 8 | res[0]);
    const uint16_t y_max = static_cast<uint16_t>(res[3] << 8 | res[2]);
    if (x_max > 0) g_touch_x_max = x_max;
    if (y_max > 0) g_touch_y_max = y_max;
    Serial.printf("[touch] GT911 resolution: %ux%u\n", g_touch_x_max, g_touch_y_max);
  }
  g_sensors_initialized = true;
}

void init_network() {
  // Read MAC address without starting the WiFi radio — keeps internal RAM
  // free for BLE provisioning on fresh devices with no stored SSID.
  {
    uint8_t mac[6];
    esp_read_mac(mac, ESP_MAC_WIFI_STA);
    char buf[18];
    snprintf(buf, sizeof(buf), "%02X:%02X:%02X:%02X:%02X:%02X", mac[0], mac[1], mac[2], mac[3], mac[4], mac[5]);
    g_cfg_device_mac = String(buf);
    g_cfg_device_mac_compact = mac_strip_colons(g_cfg_device_mac);
  }

  // Compute derived client ID from base_topic + device MAC
  {
    char cid_buf[64];
    mqtt_topics::client_id(cid_buf, sizeof(cid_buf), g_cfg_base_topic.c_str(), g_cfg_device_mac_compact.c_str());
    g_cfg_mqtt_client_id = String(cid_buf);
  }

  // Initialize WiFi provisioning manager
  WifiProvisioningConfig wifi_cfg = {};
  wifi_cfg.device_name = "Thermostat";
  wifi_cfg.firmware_name = THERMOSTAT_PROJECT_NAME;
  wifi_cfg.firmware_version = THERMOSTAT_FIRMWARE_VERSION;
  wifi_cfg.hardware_variant = "ESP32-S3";
  wifi_cfg.nvs = &g_cfg;
  // Baked creds (THERMOSTAT_WIFI_SSID/PASSWORD) seed the connection when NVS has none,
  // so a creds-baked build (e.g. the isolated bench) connects without provisioning.
  wifi_cfg.default_ssid = g_cfg_wifi_ssid.c_str();
  wifi_cfg.default_password = g_cfg_wifi_password.c_str();
  wifi_cfg.hostname = g_cfg_hostname.c_str();
  wifi_cfg.retry_interval_ms = kNetworkRetryMs;
  g_wifi.begin(wifi_cfg);
  WiFi.onEvent(wifi_event_handler);

  g_mqtt.setBufferSize(1024);
  g_mqtt.setServer(g_cfg_mqtt_host.c_str(), g_cfg_mqtt_port);
  g_mqtt.setCallback(mqtt_on_message);
  configTzTime(THERMOSTAT_TIME_TZ, THERMOSTAT_TIME_NTP_1, THERMOSTAT_TIME_NTP_2,
               THERMOSTAT_TIME_NTP_3);
}

void poll_sensors(uint32_t now_ms) {
  if (g_runtime == nullptr) return;
  if ((now_ms - g_last_sensor_poll_ms) < kSensorPollMs) return;

  g_last_sensor_poll_ms = now_ms;

  if (g_sensor_type == SensorType::AHT) {
    sensors_event_t humidity, temp;
    if (g_aht.getEvent(&humidity, &temp)) {
      g_sensor_fail_count = 0;
      g_runtime->on_local_sensor_update(temp.temperature, humidity.relative_humidity);
    } else {
      ++g_sensor_fail_count;
      Serial.printf("[sensor] AHT read failed (fail_count=%u)\n", (unsigned)g_sensor_fail_count);
      if (g_sensor_fail_count >= 5) {
        Serial.println("[sensor] too many failures, attempting I2C reset");
        g_sensor_i2c.end();
        g_sensor_i2c.begin(kSensorI2cSda, kSensorI2cScl, 100000U);
        g_sensor_type = SensorType::None;
        g_sensor_fail_count = 0;
        if (g_aht.begin(&g_sensor_i2c)) {
          sensors_event_t h, t;
          if (g_aht.getEvent(&h, &t) &&
              !(t.temperature == 0.0f && h.relative_humidity == 0.0f)) {
            g_sensor_type = SensorType::AHT;
            Serial.println("[sensor] AHT re-detected after reset");
          }
        }
        if (g_sensor_type == SensorType::None && g_si7021.begin()) {
          g_sensor_type = SensorType::Si7021;
          Serial.println("[sensor] Si7021 re-detected after reset");
        }
      }
    }
  } else if (g_sensor_type == SensorType::Si7021) {
    float temp = g_si7021.readTemperature();
    float hum = g_si7021.readHumidity();
    if (std::isfinite(temp) && std::isfinite(hum)) {
      g_sensor_fail_count = 0;
      g_runtime->on_local_sensor_update(temp, hum);
    } else {
      ++g_sensor_fail_count;
      Serial.printf("[sensor] Si7021 read failed (fail_count=%u)\n", (unsigned)g_sensor_fail_count);
      if (g_sensor_fail_count >= 5) {
        Serial.println("[sensor] too many failures, attempting I2C reset");
        g_sensor_i2c.end();
        g_sensor_i2c.begin(kSensorI2cSda, kSensorI2cScl, 100000U);
        g_sensor_type = SensorType::None;
        g_sensor_fail_count = 0;
        if (g_si7021.begin()) {
          g_sensor_type = SensorType::Si7021;
          Serial.println("[sensor] Si7021 re-detected after reset");
        } else if (g_aht.begin(&g_sensor_i2c)) {
          sensors_event_t h, t;
          if (g_aht.getEvent(&h, &t) &&
              !(t.temperature == 0.0f && h.relative_humidity == 0.0f)) {
            g_sensor_type = SensorType::AHT;
            Serial.println("[sensor] AHT re-detected after reset");
          }
        }
      }
    }
  } else if (!std::isnan(g_remote_indoor_temp_c)) {
    g_runtime->on_local_sensor_update(g_remote_indoor_temp_c, g_remote_indoor_humidity);
  }
  if (g_have_weather_data) {
    g_runtime->on_outdoor_weather_update(g_outdoor_temp_c, g_weather_icon);
  }
}

}  // namespace

#ifdef ARDUINO
// Reads NVS directly via the C API so it is safe to call from initArduino()/btInUse(),
// before the Arduino Preferences object (g_cfg) is opened. Mirrors the provisioning-entry
// condition in thermostat_firmware_setup() exactly (see provisioning_gate::needed).
static bool thermostat_provisioning_needed() {
  bool wifi_disabled = (THERMOSTAT_WIFI_DISABLED != 0);
  char ssid[64] = {0};
  nvs_handle_t h;
  // NVS_READONLY: namespace is absent on a truly fresh device -> open fails -> we keep the
  // compile-time defaults (empty SSID, not disabled) -> provisioning needed. Fail-safe:
  // if NVS is unreadable we retain BT memory (a wasted ~36 KB on a normal boot is
  // recoverable; starving the provisioning boot of BT memory is not).
  if (nvs_open(thermostat_nvs::kNamespace, NVS_READONLY, &h) == ESP_OK) {
    uint8_t off = 0;
    if (nvs_get_u8(h, thermostat_nvs::kWifiOff, &off) == ESP_OK) {
      wifi_disabled = (off != 0);
    }
    size_t len = sizeof(ssid);
    if (nvs_get_str(h, thermostat_nvs::kWifiSsid, ssid, &len) != ESP_OK) {
      ssid[0] = '\0';
    }
    nvs_close(h);
  }
  return provisioning_gate::needed(wifi_disabled, ssid, THERMOSTAT_WIFI_SSID);
}

#ifdef IMPROV_WIFI_BLE_ENABLED
// Strong override of the Arduino core's weak btInUse() (esp32-hal-bt.c). Runs in
// initArduino() after nvs_flash_init() and before esp_bt_controller_mem_release().
// Provisioning boot (no creds) -> keep BT memory so NimBLE can start. Normal boot
// (creds present) -> release ~36 KB. This replaces the old esp32-hal-bt-mem.h, which
// pinned BT memory on every boot.
extern "C" bool btInUse(void) {
  return thermostat_provisioning_needed();
}
#endif  // IMPROV_WIFI_BLE_ENABLED
#endif  // ARDUINO

// ---------- WiFi provisioning boot mode ----------
// When no WiFi SSID is configured, we enter a minimal boot mode:
// - BLE build (THERMOSTAT_BLE_PROVISIONING): advertise via Improv/NimBLE, persist creds on
//   connection, then reboot. WiFi is never started (BLE needs the internal RAM; the two
//   can't coexist). BT controller memory was retained this boot by the btInUse() override.
// - SoftAP build: bring up the captive portal (no Bluetooth) and serve DNS + web until the
//   user submits credentials, then reboot.
// In both: init the LCD, show join instructions (or run headless if the LCD failed), and
// loop until credentials arrive → reboot into normal mode (which reads the new NVS creds).
static bool g_provisioning_boot_mode = false;

extern "C" const lv_font_t thermostat_font_montserrat_20;
extern "C" const lv_font_t thermostat_font_montserrat_30;

static void run_provisioning_boot() {
#ifdef THERMOSTAT_BLE_PROVISIONING
  Serial.println("[provision] No WiFi configured — entering BLE/Improv provisioning mode");
#else
  Serial.println("[provision] No WiFi configured — entering SoftAP portal mode");
#endif
  g_provisioning_boot_mode = true;

  // Provisioning uses only one radio at a time (BLE-only or WiFi-AP-only, never both), so
  // the LCD comes up cleanly with no internal-DMA-RAM contention.
  init_backlight();
  const bool disp_ok = init_display_and_lvgl();

  WifiProvisioningConfig wifi_cfg = {};
  wifi_cfg.device_name = "Thermostat";
  wifi_cfg.firmware_name = THERMOSTAT_PROJECT_NAME;
  wifi_cfg.firmware_version = THERMOSTAT_FIRMWARE_VERSION;
  wifi_cfg.hardware_variant = "ESP32-S3";
  wifi_cfg.nvs = &g_cfg;
  wifi_cfg.retry_interval_ms = kNetworkRetryMs;
  g_wifi.begin(wifi_cfg);
#ifdef THERMOSTAT_BLE_PROVISIONING
  // BLE/Improv provisioning: persist creds via set_credentials (pure NVS write — does NOT
  // bring up WiFi STA, so BLE keeps the internal RAM it needs), then reboot. On next boot
  // creds are present, btInUse() returns false, BT memory is released, WiFi comes up.
  ImprovBleConfig icfg = {};
  icfg.device_name = "Thermostat";
  icfg.firmware_name = THERMOSTAT_PROJECT_NAME;
  icfg.firmware_version = THERMOSTAT_FIRMWARE_VERSION;
  icfg.hardware_variant = "ESP32-S3";
  icfg.device_url = nullptr;  // we never connect here; no URL to advertise
  icfg.reboot_after_provision = true;
  if (!improv_ble_start(icfg, [](const char *ssid, const char *password) {
        g_wifi.set_credentials(ssid, password);
      })) {
    // BLE failed to start — the loop below would otherwise spin forever waiting for a
    // reboot that can only be scheduled from the (never-firing) Improv callback.
    Serial.println("[provision] FATAL: improv_ble_start failed — rebooting");
    delay(3000);
    ESP.restart();
  }

  if (disp_ok) {
    lv_obj_t *scr = lv_scr_act();
    lv_obj_set_style_bg_color(scr, lv_color_black(), 0);

    lv_obj_t *title = lv_label_create(scr);
    lv_label_set_text(title, "WiFi Setup");
    lv_obj_set_style_text_color(title, lv_color_white(), 0);
    lv_obj_set_style_text_font(title, &thermostat_font_montserrat_30, 0);
    lv_obj_align(title, LV_ALIGN_CENTER, 0, -50);

