rgregg/esp32-wireless-thermostat/src/thermostat/esp32s3_thermostat_firmware.cpp
    lv_obj_t *body = lv_label_create(scr);
    lv_label_set_text(body, "Set up over Bluetooth using\nthe Improv app or improv-wifi.com");
    lv_obj_set_style_text_color(body, lv_color_make(0xCC, 0xCC, 0xCC), 0);
    lv_obj_set_style_text_font(body, &thermostat_font_montserrat_20, 0);
    lv_obj_set_style_text_align(body, LV_TEXT_ALIGN_CENTER, 0);
    lv_obj_align(body, LV_ALIGN_CENTER, 0, 20);

    ledcWrite(kBacklightPin, 200);
  } else {
    Serial.println("[provision] Display unavailable — provisioning headless via BLE only");
  }
#else
  g_wifi.start_provisioning();
  const String ap_ssid = softap_provisioning_ap_ssid();

  if (disp_ok) {
    // Provisioning screen: dark background, AP name to join.
    lv_obj_t *scr = lv_scr_act();
    lv_obj_set_style_bg_color(scr, lv_color_black(), 0);

    lv_obj_t *title = lv_label_create(scr);
    lv_label_set_text(title, "WiFi Setup");
    lv_obj_set_style_text_color(title, lv_color_white(), 0);
    lv_obj_set_style_text_font(title, &thermostat_font_montserrat_30, 0);
    lv_obj_align(title, LV_ALIGN_CENTER, 0, -50);

    lv_obj_t *body = lv_label_create(scr);
    const String msg =
        String("Join Wi-Fi network:\n") + ap_ssid + "\nthen open any web page";
    lv_label_set_text(body, msg.c_str());
    lv_obj_set_style_text_color(body, lv_color_make(0xCC, 0xCC, 0xCC), 0);
    lv_obj_set_style_text_font(body, &thermostat_font_montserrat_20, 0);
    lv_obj_set_style_text_align(body, LV_TEXT_ALIGN_CENTER, 0);
    lv_obj_align(body, LV_ALIGN_CENTER, 0, 20);

    ledcWrite(kBacklightPin, 200);
  } else {
    Serial.printf("[provision] Display unavailable — portal AP: %s\n", ap_ssid.c_str());
  }
#endif

#ifdef THERMOSTAT_BLE_PROVISIONING
  // Diagnostic: report internal-DMA-RAM headroom with BLE + LCD live. This is the resource
  // BLE/Improv was originally removed for starving, so it's only interesting on the BLE
  // path; the SoftAP path already logs free internal RAM in start_provisioning().
  Serial.printf("[provision] internal-DMA RAM: free=%u largest-contiguous=%u\n",
                (unsigned)heap_caps_get_free_size(MALLOC_CAP_INTERNAL | MALLOC_CAP_DMA),
                (unsigned)heap_caps_get_largest_free_block(MALLOC_CAP_INTERNAL | MALLOC_CAP_DMA));
#endif

  // Service the provisioning loop until the user submits credentials, then reboot into
  // normal mode (which reads the new NVS creds and connects).
  esp_task_wdt_add(NULL);
  uint32_t last_tick = millis();
  for (;;) {
    esp_task_wdt_reset();
    const uint32_t now = millis();
#ifdef THERMOSTAT_BLE_PROVISIONING
    if (improv_ble_reboot_pending()) {
      Serial.println("[provision] Credentials received — rebooting");
      ESP.restart();
    }
#else
    if (g_wifi.has_credentials()) {
      Serial.println("[provision] Credentials received — rebooting");
      delay(800);  // let the portal's "Saved" response flush to the browser
      ESP.restart();
    }
    g_wifi.ensure_connected(now);  // runs the DNS + portal web server
#endif
    if (disp_ok && (now - last_tick) >= kUiTickMs) {
      lv_tick_inc(now - last_tick);
      last_tick = now;
      lv_timer_handler();
    }
    delay(1);
  }
}

void thermostat_firmware_setup() {
  g_api_mutex = xSemaphoreCreateMutex();
  if (g_api_mutex == nullptr) {
    Serial.println("[init] FATAL: failed to create api_mutex");
    delay(3000);
    ESP.restart();
  }
  g_cfg_ready = g_cfg.begin(thermostat_nvs::kNamespace, false);
  load_runtime_config();
  g_boot_count = g_cfg_ready ? (g_cfg.getUInt("boot_cnt", 0U) + 1U) : 0U;
  if (g_cfg_ready) {
    g_cfg.putUInt("boot_cnt", g_boot_count);
  }
  g_reset_reason = reset_reason_text(esp_reset_reason());

  // If no WiFi SSID is configured, enter minimal BLE provisioning mode.
  // This must happen before display init to keep internal RAM free for BLE.
  // ESP-NOW-only mode skips this entirely — no SSID is needed and we must not
  // start BLE (it would fragment the internal RAM the LCD bounce buffer needs).
  if (thermostat_provisioning_needed()) {
    run_provisioning_boot();
    return;  // never reached — run_provisioning_boot loops forever
  }
  if (g_cfg_wifi_disabled) {
    Serial.println("[net] ESP-NOW-only mode — WiFi/MQTT/web disabled, ESP-NOW + LCD only");
    // No NTP in this mode; wall-clock time arrives over ESP-NOW from the controller.
    // Still set the timezone so the received UTC epoch renders as local time.
    setenv("TZ", THERMOSTAT_TIME_TZ, 1);
    tzset();
  }

  ThermostatDeviceRuntimeConfig cfg;
  static const uint8_t kBroadcast[6] = {0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF};
  memcpy(cfg.transport.peer_mac, kBroadcast, sizeof(kBroadcast));
  cfg.transport.channel = g_cfg_espnow_channel;
  cfg.transport.heartbeat_interval_ms = 10000;
  cfg.controller_connection_timeout_ms = g_cfg_controller_timeout_ms;
  // Resync telemetry seq on reconnect after the same gap that marks "disconnected".
  cfg.app.controller_reconnect_resync_ms = g_cfg_controller_timeout_ms;
  if (g_cfg_espnow_enabled) {
    parse_mac(g_cfg_espnow_peer_mac.c_str(), cfg.transport.peer_mac);
    uint8_t lmk[16] = {0};
    if (parse_lmk_hex(g_cfg_espnow_lmk.c_str(), lmk) &&
        !is_broadcast_mac(cfg.transport.peer_mac)) {
      memcpy(cfg.transport.lmk, lmk, sizeof(lmk));
      cfg.transport.encrypted = true;
    }
  }

  static ThermostatDeviceRuntime runtime(cfg);
  g_runtime = &runtime;

  g_screen.set_display_timeout_ms(g_display_timeout_ms);
  g_screen.on_boot(millis());

  init_backlight();
  init_sensors();
  if (!g_cfg_wifi_disabled) {
    init_network();
  }
  if (init_display_and_lvgl()) {
    create_ui();
  } else {
    Serial.println("[display] Continuing headless — UI disabled; ESP-NOW/MQTT/sensors/web active");
  }
  g_backlight_enable_at_ms = millis() + kBacklightEnableDelayMs;

  bool runtime_ok = false;
  if (g_cfg_espnow_enabled) {
    runtime_ok = g_runtime->begin();
  }
  g_last_espnow_error = runtime_ok ? "none" : (g_cfg_espnow_enabled ? "begin_failed" : "disabled");
  g_runtime->set_local_temperature_compensation_c(g_cfg_temp_comp_c);
  g_runtime->set_temperature_unit(g_cfg_temp_unit_f ? TemperatureUnit::Fahrenheit
                                                    : TemperatureUnit::Celsius);
  ota_rollback_begin();

  // Web server task on Core 0 (alongside WiFi/BT stack): handles all HTTP
  // requests without blocking the LVGL/sensor/MQTT main loop on Core 1.
  // Create web task on Core 0 with stack in PSRAM to avoid consuming
  // internal SRAM that the WiFi driver needs for connection buffers.
  // Skipped in ESP-NOW-only mode — there is no IP for it to serve on.
  if (!g_cfg_wifi_disabled) {
    static StaticTask_t web_task_tcb;
    static StackType_t *web_task_stack = (StackType_t *)heap_caps_malloc(
        8192 * sizeof(StackType_t), MALLOC_CAP_SPIRAM);
    if (!web_task_stack) {
      Serial.println("[web] PSRAM alloc failed, falling back to internal SRAM");
      web_task_stack = (StackType_t *)heap_caps_malloc(
          8192 * sizeof(StackType_t), MALLOC_CAP_INTERNAL);
    }
    if (web_task_stack) {
      xTaskCreateStaticPinnedToCore(web_server_task, "web", 8192,
                                    nullptr, 1, web_task_stack, &web_task_tcb, 0);
    } else {
      Serial.println("[web] FATAL: failed to allocate web task stack");
    }
  }
  esp_task_wdt_add(NULL);  // register main task with TWDT
  // Raise the Task Watchdog timeout to 15s so a bounded MQTT-connect spin (see
  // setSocketTimeout below) can't starve the main task's esp_task_wdt_reset().
  // idle_core_mask=0: the display's explicit main+web task registration remains
  // the watchdog coverage (esp_task_wdt_add calls are unaffected by reconfigure).
  {
    esp_task_wdt_config_t wdt_cfg = {
        .timeout_ms = 15000,
        .idle_core_mask = 0,
        .trigger_panic = true,
    };
    esp_task_wdt_reconfigure(&wdt_cfg);
  }
  // Bound PubSubClient's connect/read busy-wait (PubSubClient.cpp:257 spins with
  // no yield for up to socketTimeout) to 5s, well under the 15s watchdog.
  g_mqtt.setSocketTimeout(5);
}

void thermostat_firmware_loop() {
  esp_task_wdt_reset();

