rgregg/esp32-wireless-thermostat/src/thermostat/esp32s3_thermostat_firmware.cpp
  // During OTA upload, skip heavy work (LVGL, MQTT, sensors) to free
  // CPU for flash writes.  Use a long yield so the main task doesn't
  // compete with the web/WiFi tasks on the scheduler.
  if (ota_web_in_progress()) {
    // One-time teardown: shut down non-essential subsystems to free internal
    // SRAM for the WiFi/TCP stack during OTA.  After OTA (success or failure)
    // we always reboot, so no need to restart these.
    static bool ota_teardown_done = false;
    if (!ota_teardown_done) {
      ota_teardown_done = true;
      uint32_t heap_before = heap_caps_get_free_size(MALLOC_CAP_INTERNAL);

      // MQTT — frees ~5-6KB (TCP socket buffers)
      if (g_mqtt.connected()) {
        g_mqtt.disconnect();
      }
      // mDNS — frees ~2-5KB
      MDNS.end();
      g_mdns_started = false;
      // I2C sensors — frees ~1-2KB
      g_sensor_i2c.end();
      g_touch_i2c.end();
      // Display off + backlight off
      ledcWrite(kBacklightPin, 0);
      if (g_panel != nullptr) {
        esp_lcd_panel_disp_on_off(g_panel, false);
      }

      uint32_t heap_after = heap_caps_get_free_size(MALLOC_CAP_INTERNAL);
      Serial.printf("[ota] teardown: freed %u bytes internal SRAM (%u -> %u)\n",
                    heap_after - heap_before, heap_before, heap_after);
    }
    // Process delegated flash write operations.  The web task (PSRAM stack)
    // cannot call Update.write() directly because SPI cache is frozen during
    // flash writes, making PSRAM inaccessible.  This main loop task has its
    // stack in internal SRAM, so it's safe to write flash here.
    ota_web_process_flash_ops();
    vTaskDelay(pdMS_TO_TICKS(1));
    return;
  }

  uint32_t now = millis();
  if (g_reboot_requested && static_cast<uint32_t>(now - g_reboot_at_ms) < 0x80000000u) {
    shutdown_display_for_reboot();
    delay(kRebootPanelOffDelayMs);
    ESP.restart();
    return;
  }

  if (!g_backlight_enabled && g_backlight_enable_at_ms > 0 &&
      static_cast<uint32_t>(now - g_backlight_enable_at_ms) < 0x80000000u) {
    g_backlight_enabled = true;
    apply_backlight(g_screen.screensaver_active());
  }

  if (g_display_ready && (now - g_last_ui_tick_ms) >= kUiTickMs) {
    lv_tick_inc(now - g_last_ui_tick_ms);
    g_last_ui_tick_ms = now;
    lv_timer_handler();
  }

  // Re-capture time after LVGL processing so the runtime tick uses a
  // timestamp >= any millis() call made inside touch_read_cb.  Without
  // this, on_user_interaction(millis()) can set last_interaction_ms to a
  // value slightly *after* `now`, causing an unsigned underflow in
  // g_screen.tick(now) that immediately triggers the screensaver.
  now = millis();

  if ((now - g_last_runtime_tick_ms) >= kRuntimeTickMs) {
    g_last_runtime_tick_ms = now;
    if (g_runtime != nullptr) {
      xSemaphoreTake(g_api_mutex, portMAX_DELAY);
      g_runtime->tick(now);
      xSemaphoreGive(g_api_mutex);
    }
    if (g_display_ready) {
      g_screen.tick(now);
      show_page(g_screen.current_page());
      apply_backlight(g_screen.screensaver_active());
    }
  }

  // ESP-NOW-only mode skips all WiFi/MQTT/web/weather/OTA work: there is no IP,
  // and re-running ensure_wifi_connected() would re-trigger a join and channel-hop
  // that fights the pinned ESP-NOW channel. Controller state arrives over ESP-NOW
  // (transport callbacks), not MQTT, so the apply/publish blocks aren't needed.
  if (!g_cfg_wifi_disabled) {
    ensure_wifi_connected(now);
    wifi_watchdog_tick(now, g_mqtt.connected());
    ensure_mdns_ready();
    ensure_web_ready();
    ensure_mqtt_connected(now);
    g_mqtt.loop();
    poll_weather(now);
    ota_rollback_check(WiFi.status() == WL_CONNECTED && g_mqtt.connected());

    // Apply accumulated MQTT controller state to app layer
    if (g_runtime != nullptr && g_mqtt_ctrl_last_update_ms > g_mqtt_ctrl_last_applied_ms) {
      xSemaphoreTake(g_api_mutex, portMAX_DELAY);
      g_runtime->on_controller_state_update(
          now, g_mqtt_ctrl_state, g_mqtt_ctrl_lockout,
          g_mqtt_ctrl_mode, g_mqtt_ctrl_fan,
          g_mqtt_ctrl_setpoint_c, g_mqtt_ctrl_filter_runtime_s,
          g_mqtt_ctrl_windows_open);
      g_mqtt_ctrl_last_applied_ms = g_mqtt_ctrl_last_update_ms;
      xSemaphoreGive(g_api_mutex);
    }

    {
      const bool should_publish = g_mqtt_state_dirty ||
                                  (now - g_last_mqtt_publish_ms >= kMqttPublishMs);
      if (should_publish && g_mqtt.connected()) {
        xSemaphoreTake(g_api_mutex, portMAX_DELAY);
        mqtt_publish_state();
        g_mqtt_state_dirty = false;
        g_last_mqtt_publish_ms = now;
        xSemaphoreGive(g_api_mutex);
      }
    }
  }

  xSemaphoreTake(g_api_mutex, portMAX_DELAY);
  poll_sensors(now);
  xSemaphoreGive(g_api_mutex);

  if (g_display_ready && (now - g_last_ui_refresh_ms) >= kUiRefreshMs) {
    g_last_ui_refresh_ms = now;
    refresh_ui();
  }

  // Log the on-screen status whenever it changes — the only window into displayed
  // state on a headless / ESP-NOW-only display (no screen access, no web/MQTT).
  if (g_runtime != nullptr) {
    static std::string prev_status;
    std::string s = g_runtime->status_text(now);
    if (s != prev_status) {
      prev_status = s;
      Serial.printf("[status] %s\n", s.c_str());
    }
  }

  // Isolation reboot: if both MQTT and ESP-NOW have been down continuously
  // for >15 minutes, the network stack is likely wedged — reboot to recover.
  {
    const uint32_t hb_ms = g_runtime != nullptr ? g_runtime->last_controller_heartbeat_ms() : 0;
    const bool espnow_active = (hb_ms > 0) &&
        (static_cast<uint32_t>(now - hb_ms) < g_cfg_controller_timeout_ms);
    // Log controller ESP-NOW connect/disconnect transitions. The only way to see
    // link state on a headless / ESP-NOW-only display (no screen access, no web/MQTT).
    static int prev_espnow_active = -1;  // -1 = unset → logs the first evaluation
    if (static_cast<int>(espnow_active) != prev_espnow_active) {
      prev_espnow_active = static_cast<int>(espnow_active);
      Serial.printf("[espnow] controller %s (hb=%lu ago=%lums)\n",
                    espnow_active ? "CONNECTED" : "disconnected",
                    static_cast<unsigned long>(hb_ms),
                    hb_ms > 0 ? static_cast<unsigned long>(now - hb_ms) : 0UL);
    }
    const bool isolated = !g_mqtt.connected() && !espnow_active;

    if (!isolated) {
      g_isolation_start_ms = 0;  // reset: at least one channel is healthy
    } else if (g_isolation_start_ms == 0) {
      g_isolation_start_ms = now;  // start tracking isolation
      Serial.printf("[watchdog] isolation_start: mqtt=%d espnow_hb=%lu ago=%lums\n",
                    g_mqtt.connected() ? 1 : 0,
                    static_cast<unsigned long>(hb_ms),
                    hb_ms > 0 ? static_cast<unsigned long>(now - hb_ms) : 0UL);
    } else if (static_cast<uint32_t>(now - g_isolation_start_ms) >= kIsolationRebootMs) {
      Serial.printf("[watchdog] isolation_reboot: isolated for %lus mqtt=%d espnow_hb=%lu ago=%lums\n",
                    static_cast<unsigned long>((now - g_isolation_start_ms) / 1000),
                    g_mqtt.connected() ? 1 : 0,
                    static_cast<unsigned long>(hb_ms),
                    hb_ms > 0 ? static_cast<unsigned long>(now - hb_ms) : 0UL);
      Serial.flush();
      delay(100);
      ESP.restart();
    }
  }
}

}  // namespace thermostat

#endif
